<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>竹里馆</title>
  
  <link href="/atom.xml" rel="self"/>
  
  <link href="http://lnxpgn.github.io/"/>
  <updated>2016-05-05T14:02:00.000Z</updated>
  <id>http://lnxpgn.github.io/</id>
  
  <author>
    <name>lnxpgn</name>
    
  </author>
  
  <generator uri="http://hexo.io/">Hexo</generator>
  
  <entry>
    <title>Web开发者的简单颜色指南</title>
    <link href="http://lnxpgn.github.io/2016/04/18/a-simple-web-developer-guide-to-color/"/>
    <id>http://lnxpgn.github.io/2016/04/18/a-simple-web-developer-guide-to-color/</id>
    <published>2016-04-18T08:55:15.000Z</published>
    <updated>2016-05-05T14:02:00.000Z</updated>
    
    <content type="html">&lt;p&gt;&amp;#x6211;&amp;#x4ECE;&amp;#x6765;&amp;#x4E0D;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x989C;&amp;#x8272;&amp;#x7406;&amp;#x8BBA;&amp;#x7684;&amp;#x7231;&amp;#x597D;&amp;#x8005;&amp;#x3002;&amp;#x6211;&amp;#x60F3;&amp;#x662F;&amp;#x56E0;&amp;#x4E3A;&amp;#x6211;&amp;#x5BF9;&amp;#x5B83;&amp;#x4E00;&amp;#x76F4;&amp;#x4E0D;&amp;#x62B1;&amp;#x5E0C;&amp;#x671B;&amp;#x3002;&amp;#x6211;&amp;#x4E50;&amp;#x610F;&amp;#x5750;&amp;#x5728;&amp;#x90A3;&amp;#x513F;&amp;#xFF0C;&amp;#x8272;&amp;#x73AF;&amp;#x5728;&amp;#x624B;&amp;#xFF0C;&amp;#x9009;&amp;#x53D6;&amp;#x4E92;&amp;#x8865;&amp;#x8272;&amp;#x3001;&amp;#x5206;&amp;#x6563;&amp;#x7684;&amp;#x4E92;&amp;#x8865;&amp;#x8272;&amp;#x3001;&amp;#x4E09;&amp;#x8272;&amp;#x914D;&amp;#x8272;&amp;#x65B9;&amp;#x6848;&amp;#xFF0C;&amp;#x8BA9;&amp;#x670B;&amp;#x53CB;&amp;#x3001;&amp;#x5BB6;&amp;#x4EBA;&amp;#x3001;&amp;#x5BA2;&amp;#x6237;&amp;#x5370;&amp;#x8C61;&amp;#x6DF1;&amp;#x523B;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x8BF4;&amp;#x5B9E;&amp;#x8BDD;&amp;#xFF0C;&amp;#x989C;&amp;#x8272;&amp;#x7406;&amp;#x8BBA;&amp;#x5BF9;&amp;#x6211;&amp;#x5F88;&amp;#x9065;&amp;#x8FDC;&amp;#xFF0C;&amp;#x5C1D;&amp;#x8BD5;&amp;#x5728;&amp;#x9879;&amp;#x76EE;&amp;#x4E2D;&amp;#x4F7F;&amp;#x7528;&amp;#x989C;&amp;#x8272;&amp;#x65F6;&amp;#x6211;&amp;#x4ECE;&amp;#x672A;&amp;#x53D1;&amp;#x73B0;&amp;#x5B83;&amp;#x6709;&amp;#x7528;&amp;#x3002;&amp;#x6709;&amp;#x70B9;&amp;#x8BBD;&amp;#x523A;&amp;#xFF0C;&amp;#x6211;&amp;#x53D1;&amp;#x73B0;&amp;#xFF0C;&amp;#x989C;&amp;#x8272;&amp;#x7684;&amp;#x9009;&amp;#x62E9;&amp;#x3001;&amp;#x8FD0;&amp;#x7528;&amp;#x5F97;&amp;#x8D8A;&amp;#x597D;&amp;#xFF0C;&amp;#x80CC;&amp;#x540E;&amp;#x7684;&amp;#x7406;&amp;#x8BBA;&amp;#x6211;&amp;#x8D8A;&amp;#x6709;&amp;#x66F4;&amp;#x597D;&amp;#x7684;&amp;#x8BA4;&amp;#x8BC6;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x5F53;&amp;#x7136;&amp;#xFF0C;&amp;#x521A;&amp;#x8D77;&amp;#x6B65;&amp;#x65F6;&amp;#x7406;&amp;#x8BBA;&amp;#x5E76;&amp;#x6CA1;&amp;#x6709;&amp;#x771F;&amp;#x6B63;&amp;#x5F97;&amp;#x5E2E;&amp;#x52A9;&amp;#xFF0C;&amp;#x5BF9;&amp;#x5427;&amp;#xFF1F;&amp;#x8FD9;&amp;#x5C31;&amp;#x662F;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#xFF0C;&amp;#x5728;&amp;#x8FD9;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x91CC;&amp;#xFF0C;&amp;#x4F60;&amp;#x4E0D;&amp;#x4F1A;&amp;#x770B;&amp;#x5230;&amp;#x4E00;&amp;#x4E2A;&amp;#x5355;&amp;#x4E00;&amp;#x7684;&amp;#x8272;&amp;#x73AF;&amp;#xFF0C;&amp;#x76F8;&amp;#x53CD;&amp;#xFF0C;&amp;#x6211;&amp;#x4F1A;&amp;#x5C55;&amp;#x793A;&amp;#x4E00;&amp;#x4E2A;&amp;#x7B80;&amp;#x5355;&amp;#x7684;&amp;#x4F60;&amp;#x80FD;&amp;#x7528;&amp;#x5728;&amp;#x4E0B;&amp;#x4E00;&amp;#x4E2A;Web&amp;#x9879;&amp;#x76EE;&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#x5DE5;&amp;#x4F5C;&amp;#x6D41;&amp;#x3002;&lt;/p&gt;
&lt;a id=&quot;more&quot;&gt;&lt;/a&gt;
&lt;p&gt;&amp;#x5F53;&amp;#x7136;&amp;#xFF0C;&amp;#x8FC7;&amp;#x7A0B;&amp;#x4E2D;&amp;#x4F60;&amp;#x662F;&amp;#x5728;&amp;#x6F5C;&amp;#x610F;&amp;#x8BC6;&amp;#x5730;&amp;#x5B66;&amp;#x4E60;&amp;#x7406;&amp;#x8BBA;&amp;#x3002;&amp;#x4E3A;&amp;#x4E86;&amp;#x597D;&amp;#x73A9;&amp;#xFF08;&amp;#x662F;&amp;#x7684;&amp;#xFF0C;&amp;#x6211;&amp;#x662F;&amp;#x8BF4;&amp;#x201C;&amp;#x597D;&amp;#x73A9;&amp;#x201D;&amp;#xFF09;&amp;#xFF0C;&amp;#x6211;&amp;#x5EFA;&amp;#x8BAE;&amp;#x51E0;&amp;#x4E2A;&amp;#x6708;&amp;#x540E;&amp;#x56DE;&amp;#x6765;&amp;#x518D;&amp;#x91CD;&amp;#x6E29;&amp;#x4E00;&amp;#x4E0B;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x968F;&amp;#x540E;&amp;#x4F60;&amp;#x4F1A;&amp;#x6709;&amp;#x66F4;&amp;#x6DF1;&amp;#x523B;&amp;#x7684;&amp;#x7406;&amp;#x89E3;&amp;#xFF0C;&amp;#x6211;&amp;#x4FDD;&amp;#x8BC1;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x8BD1;&amp;#x8005;&amp;#x6CE8;&amp;#xFF1A;&lt;/p&gt;
&lt;p&gt;&amp;#x989C;&amp;#x8272;&amp;#x7406;&amp;#x8BBA;&amp;#x57FA;&amp;#x7840;&amp;#x76F8;&amp;#x5173;&amp;#xFF1A;&lt;a href=&quot;http://www.ruanyifeng.com/blog/2008/07/color_theory.html&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x5173;&amp;#x4E8E;&amp;#x989C;&amp;#x8272;&amp;#x7406;&amp;#x8BBA;&lt;/a&gt;&amp;#xFF0C;&lt;a href=&quot;http://mmmono.com/item/255724/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x4E09;&amp;#x5206;&amp;#x949F;&amp;#x5E2E;&amp;#x4F60;&amp;#x5FEB;&amp;#x901F;&amp;#x5165;&amp;#x95E8;&amp;#x6781;&amp;#x7B80;&amp;#x8272;&amp;#x5F69;&amp;#x5B66;&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x9009;&amp;#x62E9;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&quot;&gt;&amp;#x9009;&amp;#x62E9;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&lt;/h2&gt;
&lt;p&gt;&amp;#x6211;&amp;#x4EEC;&amp;#x603B;&amp;#x662F;&amp;#x80FD;&amp;#x770B;&amp;#x5230;&amp;#x8C61;&lt;a href=&quot;http://www.rit-mcsl.org/fairchild/WhyIsColor/files/ExamplePage.pdf&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x4E00;&amp;#x5343;&amp;#x4E07;&amp;#x79CD;&amp;#x989C;&amp;#x8272;&lt;/a&gt;&amp;#x8FD9;&amp;#x6837;&amp;#x53EF;&amp;#x7B11;&amp;#x7684;&amp;#x4E8B;&amp;#x60C5;&amp;#x3002;&amp;#x60F3;&amp;#x60F3;&amp;#xFF0C;&amp;#x4E00;&amp;#x5343;&amp;#x4E07;&amp;#x79CD;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x4F17;&amp;#x591A;&amp;#x989C;&amp;#x8272;&amp;#x4E2D;&amp;#xFF0C;&amp;#x53EA;&amp;#x9700;&amp;#x9009;&amp;#x4E00;&amp;#x79CD;&amp;#x7528;&amp;#x4E8E;&amp;#x6211;&amp;#x4EEC;&amp;#x7684;&amp;#x54C1;&amp;#x724C;&amp;#xFF0C;&amp;#x5B83;&amp;#x4E5F;&amp;#x662F;&amp;#x7F51;&amp;#x7AD9;&amp;#x7684;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x5176;&amp;#x4ED6;&amp;#x989C;&amp;#x8272;&amp;#x5747;&amp;#x57FA;&amp;#x4E8E;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#x8FD9;&amp;#x5F88;&amp;#x91CD;&amp;#x8981;&amp;#xFF0C;&amp;#x4F46;&amp;#x4E0D;&amp;#x7528;&amp;#x62C5;&amp;#x5FC3;&amp;#xFF1A;&amp;#x4F60;&amp;#x4E0D;&amp;#x4F1A;&amp;#x72AF;&amp;#x9519;&amp;#x7684;&amp;#x3002;&lt;/p&gt;
&lt;h3 id=&quot;&amp;#x5982;&amp;#x4F55;&amp;#x9009;&amp;#x62E9;&amp;#x8D77;&amp;#x59CB;&amp;#x8272;&quot;&gt;&amp;#x5982;&amp;#x4F55;&amp;#x9009;&amp;#x62E9;&amp;#x8D77;&amp;#x59CB;&amp;#x8272;&lt;/h3&gt;
&lt;p&gt;&amp;#x968F;&amp;#x610F;&amp;#x9009;&amp;#x53D6;&amp;#x4E00;&amp;#x79CD;&amp;#x989C;&amp;#x8272;&amp;#x5F88;&amp;#x7B80;&amp;#x5355;&amp;#xFF0C;&amp;#x4F46;&amp;#x6211;&amp;#x4EEC;&amp;#x4E0D;&amp;#x90A3;&amp;#x6837;&amp;#x505A;&amp;#x3002;&amp;#x5BF9;&amp;#x4E8E;&amp;#x4EFB;&amp;#x4F55;&amp;#x4E0E;&amp;#x5BA2;&amp;#x6237;&amp;#x6253;&amp;#x4EA4;&amp;#x9053;&amp;#x7684;&amp;#x9879;&amp;#x76EE;&amp;#xFF0C;&amp;#x4F60;&amp;#x5E94;&amp;#x8BE5;&amp;#x5C3D;&amp;#x53EF;&amp;#x80FD;&amp;#x5730;&amp;#x8BC1;&amp;#x660E;&amp;#x4F60;&amp;#x7684;&amp;#x9009;&amp;#x62E9;&amp;#xFF0C;&amp;#x4E0D;&amp;#x8FD9;&amp;#x6837;&amp;#xFF0C;&amp;#x4F60;&amp;#x559C;&amp;#x7231;&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#x53EF;&amp;#x80FD;&amp;#x4E0E;&amp;#x4ED6;&amp;#x4EEC;&amp;#x559C;&amp;#x7231;&amp;#x7684;&amp;#x76F8;&amp;#x62B5;&amp;#x89E6;&amp;#x3002;&amp;#x4ED6;&amp;#x4EEC;&amp;#x662F;&amp;#x5BA2;&amp;#x6237;&amp;#xFF0C;&amp;#x4ED6;&amp;#x4EEC;&amp;#x4ED8;&amp;#x94B1;&amp;#xFF0C;&amp;#x4ED6;&amp;#x4EEC;&amp;#x4F1A;&amp;#x8D62;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x4E0D;&amp;#x8981;&amp;#x8FC7;&amp;#x8651;&amp;#x3002;&amp;#x786E;&amp;#x4FDD;&amp;#x4F60;&amp;#x6709;&amp;#x9009;&amp;#x62E9;&amp;#x7684;&amp;#x7406;&amp;#x7531;&amp;#xFF0C;&amp;#x4F1A;&amp;#x8BA9;&amp;#x4F60;&amp;#x597D;&amp;#x770B;&amp;#x70B9;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x9009;&amp;#x62E9;&amp;#x8D77;&amp;#x59CB;&amp;#x8272;&amp;#x7684;&amp;#x5C0F;&amp;#x8D34;&amp;#x58EB;&lt;/strong&gt;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;&amp;#x7528;&amp;#x4F60;&amp;#x6709;&amp;#x7684;&amp;#x989C;&amp;#x8272;&lt;/strong&gt;&lt;br&gt;
&amp;#x5982;&amp;#x679C;&amp;#x5BA2;&amp;#x6237;&amp;#x6709;&amp;#x5DF2;&amp;#x786E;&amp;#x7ACB;&amp;#x989C;&amp;#x8272;&amp;#x7684;LOGO&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E2A;&amp;#x989C;&amp;#x8272;&amp;#x901A;&amp;#x5E38;&amp;#x662F;&amp;#x4F60;&amp;#x7684;&amp;#x8D77;&amp;#x59CB;&amp;#x8272;&amp;#x3002;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#x6392;&amp;#x9664;&amp;#x7ADE;&amp;#x4E89;&amp;#x5BF9;&amp;#x624B;&amp;#x7684;&amp;#x989C;&amp;#x8272;&lt;/strong&gt;&lt;br&gt;
&amp;#x5982;&amp;#x679C;&amp;#x4F60;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E3B;&amp;#x8981;&amp;#x7ADE;&amp;#x4E89;&amp;#x5BF9;&amp;#x624B;&amp;#x6709;&amp;#x4E00;&amp;#x4E2A;&amp;#x6709;&amp;#x5F71;&amp;#x54CD;&amp;#x529B;&amp;#x7684;&amp;#x54C1;&amp;#x724C;&amp;#x989C;&amp;#x8272;&amp;#xFF0C;&amp;#x4E0D;&amp;#x8981;&amp;#x62F7;&amp;#x8D1D;&amp;#x5373;&amp;#x4F7F;&amp;#x4F60;&amp;#x80FD;&amp;#x6539;&amp;#x8FDB;&amp;#x3002;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#x8003;&amp;#x8651;&amp;#x4F60;&amp;#x7684;&amp;#x76EE;&amp;#x6807;&amp;#x53D7;&amp;#x4F17;&lt;/strong&gt;&lt;br&gt;
&amp;#x6BA1;&amp;#x4EEA;&amp;#x9986;&amp;#x7F51;&amp;#x7AD9;&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#x4E0E;&amp;#x513F;&amp;#x7AE5;&amp;#x4FF1;&amp;#x4E50;&amp;#x90E8;&amp;#x7684;&amp;#x662F;&amp;#x975E;&amp;#x5E38;&amp;#x4E0D;&amp;#x540C;&amp;#x7684;&amp;#x3002;&amp;#x60F3;&amp;#x60F3;&amp;#x8C01;&amp;#x4F1A;&amp;#x4F7F;&amp;#x7528;&amp;#x7F51;&amp;#x7AD9;&amp;#xFF0C;&amp;#x60F3;&amp;#x8BA9;&amp;#x4ED6;&amp;#x4EEC;&amp;#x6709;&amp;#x4EC0;&amp;#x4E48;&amp;#x6837;&amp;#x7684;&amp;#x611F;&amp;#x53D7;&amp;#xFF08;&amp;#x5174;&amp;#x594B;&amp;#xFF0C;&amp;#x4E25;&amp;#x8083;&amp;#xFF0C;&amp;#x5173;&amp;#x7231;&amp;#x7B49;&amp;#xFF09;&amp;#x3002;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#x4E0D;&amp;#x8981;&amp;#x843D;&amp;#x5165;&amp;#x601D;&amp;#x7EF4;&amp;#x5B9A;&amp;#x52BF;&lt;/strong&gt;&lt;br&gt;
&amp;#x5982;&amp;#x679C;&amp;#x4F60;&amp;#x4E3A;&amp;#x5E74;&amp;#x8F7B;&amp;#x5973;&amp;#x5B69;&amp;#x8BBE;&amp;#x8BA1;&amp;#x7F51;&amp;#x7AD9;&amp;#xFF0C;&amp;#x4E0D;&amp;#x662F;&amp;#x975E;&amp;#x8981;&amp;#x4F7F;&amp;#x7528;&amp;#x7C89;&amp;#x7EA2;&amp;#x8272;&amp;#x3002;&amp;#x907F;&amp;#x514D;&amp;#x4F7F;&amp;#x7528;&amp;#x8001;&amp;#x4E00;&amp;#x5957;&amp;#x6765;&amp;#x53D6;&amp;#x5F97;&amp;#x8BA4;&amp;#x53EF;&amp;#x3002;&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;&amp;#x73A9;&amp;#x4E2A;&amp;#x6587;&amp;#x5B57;&amp;#x6E38;&amp;#x620F;&lt;/strong&gt;&lt;br&gt;
&amp;#x5982;&amp;#x679C;&amp;#x4F60;&amp;#x5728;&amp;#x7EA0;&amp;#x7ED3;&amp;#xFF0C;&amp;#x5199;&amp;#x4E0B;&amp;#x4EFB;&amp;#x4F55;&amp;#x4E0E;&amp;#x5BA2;&amp;#x6237;&amp;#x4E1A;&amp;#x52A1;&amp;#x76F8;&amp;#x5173;&amp;#x7684;&amp;#x8BCD;&amp;#x8BED;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E2A;&amp;#x8BCD;&amp;#x8BED;&amp;#x5217;&amp;#x8868;&amp;#x5E94;&amp;#x8BE5;&amp;#x53EF;&amp;#x4EE5;&amp;#x7ED9;&amp;#x4F60;&amp;#x4E00;&amp;#x4E9B;&amp;#x6709;&amp;#x5173;&amp;#x989C;&amp;#x8272;&amp;#x7684;&amp;#x4E3B;&amp;#x610F;&amp;#x3002;&amp;#x5982;&amp;#x679C;&amp;#x4F60;&amp;#x8FD8;&amp;#x662F;&amp;#x5B9E;&amp;#x5728;&amp;#x7EA0;&amp;#x7ED3;&amp;#xFF0C;&amp;#x767B;&amp;#x4E0A;&amp;#x8BB2;&amp;#x89E3;&amp;#x989C;&amp;#x8272;&amp;#x7684;&amp;#x7F51;&amp;#x7AD9;&amp;#xFF0C;&amp;#x770B;&amp;#x4E0B;&amp;#x54EA;&amp;#x4E2A;&amp;#x6700;&amp;#x5408;&amp;#x9002;&amp;#x3002;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#x73B0;&amp;#x5728;&amp;#x4F60;&amp;#x5FC3;&amp;#x4E2D;&amp;#x5E94;&amp;#x8BE5;&amp;#x6709;&amp;#x4E86;&amp;#x4E00;&amp;#x4E2A;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&amp;#x3002;&amp;#x5B83;&amp;#x5E94;&amp;#x8BE5;&amp;#x662F;&amp;#x4E00;&amp;#x79CD;&amp;#x7B80;&amp;#x5355;&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#xFF0C;&amp;#x8C61;&amp;#x7EA2;&amp;#x8272;&amp;#xFF0C;&amp;#x7EFF;&amp;#x8272;&amp;#xFF0C;&amp;#x84DD;&amp;#x8272;&amp;#xFF0C;&amp;#x9EC4;&amp;#x8272;&amp;#x6216;&amp;#x7C89;&amp;#x7EA2;&amp;#x8272;&amp;#x3002;&amp;#x63A5;&amp;#x4E0B;&amp;#x6765;&amp;#x6211;&amp;#x4EEC;&amp;#x8BF4;&amp;#x8BF4;&amp;#x8272;&amp;#x5EA6;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x5047;&amp;#x8BBE;&amp;#x4F60;&amp;#x9009;&amp;#x62E9;&amp;#x4E86;&amp;#x84DD;&amp;#x8272;&amp;#xFF08;&amp;#x597D;&amp;#x9009;&amp;#x62E9;&amp;#xFF0C;&amp;#x987A;&amp;#x4FBF;&amp;#x8BF4;&amp;#x4E00;&amp;#x4E0B;&amp;#xFF01;&amp;#xFF09;&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x9009;&amp;#x62E9;&amp;#x597D;&amp;#x7684;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&quot;&gt;&amp;#x9009;&amp;#x62E9;&amp;#xFF08;&amp;#x597D;&amp;#x7684;&amp;#xFF09;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&lt;/h2&gt;
&lt;p&gt;&amp;#x6211;&amp;#x4EEC;&amp;#x8C61;&amp;#x827A;&amp;#x672F;&amp;#x5BB6;&amp;#x4E00;&amp;#x6837;&amp;#x53BB;&amp;#x527D;&amp;#x7A83;&amp;#xFF0C;&amp;#x4F7F;&amp;#x7528;&amp;#x5176;&amp;#x4ED6;&amp;#x4EBA;&amp;#x7684;&amp;#x9009;&amp;#x62E9;&amp;#xFF0C;&amp;#x800C;&amp;#x4E0D;&amp;#x662F;&amp;#x4E3A;&amp;#x4E86;&amp;#x5BFB;&amp;#x627E;&amp;#x4E00;&amp;#x79CD;&amp;#x597D;&amp;#x8272;&amp;#x5EA6;&amp;#x7684;&amp;#x84DD;&amp;#x8272;&amp;#xFF0C;&amp;#x88AB;Photoshop&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#x62FE;&amp;#x53D6;&amp;#x5668;&amp;#x6240;&amp;#x56F0;&amp;#x6270;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x9996;&amp;#x5148;&amp;#xFF0C;&amp;#x5230;&lt;a href=&quot;https://dribbble.com/colors/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Dribbble&lt;/a&gt;&amp;#x548C;&lt;a href=&quot;http://designspiration.net/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Designspiration&lt;/a&gt;&amp;#xFF0C;&amp;#x70B9;&amp;#x51FB;&amp;#x5B83;&amp;#x4EEC;&amp;#x7684;&amp;quot;Colors&amp;quot;&amp;#x94FE;&amp;#x63A5;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x4F1A;&amp;#x663E;&amp;#x793A;&amp;#x76F8;&amp;#x4F3C;&amp;#x7684;&amp;#x5C4F;&amp;#x5E55;:
&lt;img src=&quot;/images/01-dribble-designspiration-screenshot-opt.jpg&quot; alt=&quot;image&quot;&gt;
&lt;em&gt;&amp;#x4F7F;&amp;#x7528;&amp;#x7075;&amp;#x611F;&amp;#x7F51;&amp;#x7AD9;&amp;#x4E3A;&amp;#x4F60;&amp;#x7684;&amp;#x8BBE;&amp;#x8BA1;&amp;#x5BFB;&amp;#x627E;&amp;#x4E00;&amp;#x79CD;&amp;#x5408;&amp;#x9002;&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#xFF08;&lt;a href=&quot;https://media-mediatemple.netdna-ssl.com/wp-content/uploads/2016/03/01-dribble-designspiration-screenshot-opt.jpg&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x5927;&amp;#x56FE;&lt;/a&gt;&amp;#xFF09;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x4F60;&amp;#x53EF;&amp;#x4EE5;&amp;#x628A;&amp;#x8FD9;&amp;#x4F5C;&amp;#x4E3A;&amp;#x5BFB;&amp;#x627E;&amp;#x4E00;&amp;#x4E2A;&amp;#x5408;&amp;#x9002;&amp;#x8272;&amp;#x5EA6;&amp;#x7684;&amp;#x84DD;&amp;#x8272;&amp;#x7684;&amp;#x4E0B;&amp;#x4E00;&amp;#x6B65;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x5BF9;&amp;#x4E8E;&amp;#x4E00;&amp;#x4E2A;&amp;#x6E05;&amp;#x65B0;&amp;#x3001;&amp;#x5145;&amp;#x6EE1;&amp;#x6D3B;&amp;#x529B;&amp;#x7684;&amp;#x54C1;&amp;#x724C;&amp;#xFF0C;&amp;#x9009;&amp;#x62E9;&amp;#x4E00;&amp;#x4E2A;&amp;#x66F4;&amp;#x6D45;&amp;#x3001;&amp;#x66F4;&amp;#x660E;&amp;#x4EAE;&amp;#x7684;&amp;#x84DD;&amp;#x8272;&amp;#xFF08;&amp;#x524D;5&amp;#x4E2A;&amp;#x4E2D;&amp;#x7684;&amp;#x4E00;&amp;#x4E2A;&amp;#xFF09;&amp;#xFF0C;&amp;#x5BF9;&amp;#x4E8E;&amp;#x8F83;&amp;#x5546;&amp;#x4E1A;&amp;#x3001;&amp;#x4E25;&amp;#x8083;&amp;#x4E00;&amp;#x70B9;&amp;#x7684;&amp;#xFF0C;&amp;#x5E95;&amp;#x90E8;&amp;#x7684;5&amp;#x4E2A;&amp;#x662F;&amp;#x66F4;&amp;#x597D;&amp;#x7684;&amp;#x9009;&amp;#x62E9;&amp;#x3002;
&lt;img src=&quot;/images/02-color-characteristics-opt.jpg&quot; alt=&quot;image&quot;&gt;
&lt;em&gt;&amp;#x4E0D;&amp;#x540C;&amp;#x8272;&amp;#x5EA6;&amp;#x7684;&amp;#x84DD;&amp;#x8272;&amp;#x6709;&amp;#x7740;&amp;#x4E0D;&amp;#x540C;&amp;#x7684;&amp;#x7279;&amp;#x8D28;&amp;#xFF0C;&amp;#x9009;&amp;#x62E9;&amp;#x8981;&amp;#x660E;&amp;#x667A;&amp;#xFF01;&amp;#xFF08;&lt;a href=&quot;https://media-mediatemple.netdna-ssl.com/wp-content/uploads/2016/03/02-color-characteristics-opt.jpg&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x5927;&amp;#x56FE;&lt;/a&gt;&amp;#xFF09;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x9009;&amp;#x62E9;&amp;#x4E00;&amp;#x79CD;&amp;#x8272;&amp;#x5EA6;&amp;#xFF0C;&amp;#x67E5;&amp;#x770B;&amp;#x4F7F;&amp;#x7528;&amp;#x8FD9;&amp;#x79CD;&amp;#x989C;&amp;#x8272;&amp;#x7684;&amp;#x7F51;&amp;#x7AD9;&amp;#x7684;&amp;#x5B9E;&amp;#x9645;&amp;#x8BBE;&amp;#x8BA1;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x4F60;&amp;#x53EF;&amp;#x4EE5;&amp;#x4F7F;&amp;#x7528;&lt;a href=&quot;https://css-tricks.com/grabbing-hex-codes-for-colors/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;CSS-Tricks&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#x62FE;&amp;#x53D6;&amp;#x6280;&amp;#x672F;&lt;/a&gt;&amp;#x4ECE;&amp;#x6D4F;&amp;#x89C8;&amp;#x5668;&amp;#x4E2D;&amp;#x63D0;&amp;#x53D6;&amp;#x7CBE;&amp;#x786E;&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#x503C;&amp;#x3002;
&lt;img src=&quot;/images/03-dribbble-color-results-opt.jpg&quot; alt=&quot;image&quot;&gt;
&lt;em&gt;&amp;#x8FD9;&amp;#x4E48;&amp;#x591A;&amp;#x7684;&amp;#x84DD;&amp;#x8272;&amp;#xFF01;&amp;#x4F60;&amp;#x7684;&amp;#x5DE5;&amp;#x4F5C;&amp;#x5C31;&amp;#x662F;&amp;#x6311;&amp;#x4E00;&amp;#x4E2A;&amp;#x6700;&amp;#x9002;&amp;#x5408;&amp;#x4F60;&amp;#x54C1;&amp;#x724C;&amp;#x7684;&amp;#x3002;&amp;#x7B80;&amp;#x5355;&amp;#x5F97;&amp;#x5F88;&amp;#xFF01;&amp;#xFF08;&lt;a href=&quot;https://media-mediatemple.netdna-ssl.com/wp-content/uploads/2016/03/03-dribbble-color-results-opt.jpg&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x5927;&amp;#x56FE;&lt;/a&gt;&amp;#xFF09;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x4F60;&amp;#x4E0D;&amp;#x4EC5;&amp;#x4F1A;&amp;#x770B;&amp;#x5230;&amp;#x4E0D;&amp;#x540C;&amp;#x7248;&amp;#x672C;&amp;#x7684;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&amp;#xFF0C;&amp;#x4E5F;&amp;#x5F88;&amp;#x5BB9;&amp;#x6613;&amp;#x770B;&amp;#x5230;&amp;#x4E0E;&amp;#x4E4B;&amp;#x5339;&amp;#x914D;&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x521B;&amp;#x5EFA;&amp;#x8272;&amp;#x5F69;&amp;#x8854;&amp;#x63A5;&amp;#x7684;&amp;#x8C03;&amp;#x8272;&amp;#x677F;&quot;&gt;&amp;#x521B;&amp;#x5EFA;&amp;#x8272;&amp;#x5F69;&amp;#x8854;&amp;#x63A5;&amp;#x7684;&amp;#x8C03;&amp;#x8272;&amp;#x677F;&lt;/h2&gt;
&lt;p&gt;&amp;#x597D;&amp;#x4E86;&amp;#xFF0C;&amp;#x4F60;&amp;#x5E94;&amp;#x8BE5;&amp;#x6709;&amp;#x4E86;&amp;#x4E00;&amp;#x4E2A;&amp;#x989C;&amp;#x8272;&amp;#x7684;16&amp;#x8FDB;&amp;#x5236;&amp;#x503C;&amp;#x3002;&amp;#x6211;&amp;#x7684;&amp;#x662F;&lt;code&gt;#30c9e8&lt;/code&gt;&amp;#x3002;&amp;#x73B0;&amp;#x5728;&amp;#x6211;&amp;#x4EEC;&amp;#x4F7F;&amp;#x7528;&amp;#x8FD9;&amp;#x4E2A;&amp;#x989C;&amp;#x8272;&amp;#x5EFA;&amp;#x4E00;&amp;#x4E2A;&amp;#x8C03;&amp;#x8272;&amp;#x677F;&amp;#x3002;&amp;#x4F1A;&amp;#x6BD4;&amp;#x4F60;&amp;#x60F3;&amp;#x50CF;&amp;#x7684;&amp;#x5BB9;&amp;#x6613;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x5F53;&amp;#x60F3;&amp;#x5230;&amp;#x521B;&amp;#x5EFA;&amp;#x914D;&amp;#x8272;&amp;#x65B9;&amp;#x6848;&amp;#x65F6;&amp;#xFF0C;&amp;#x4F60;&amp;#x53EF;&amp;#x80FD;&amp;#x6709;&amp;#x8FD9;&amp;#x6837;&amp;#x7684;&amp;#x60F3;&amp;#x8C61;&amp;#xFF1A;&lt;br&gt;
&lt;img src=&quot;/images/04-colour-lovers-palettes-opt.jpg&quot; alt=&quot;image&quot;&gt;&lt;br&gt;
&lt;em&gt;&amp;#x4F60;&amp;#x53EF;&amp;#x80FD;&amp;#x89C1;&amp;#x8FC7;&amp;#x8FD9;&amp;#x79CD;&amp;#x8C03;&amp;#x8272;&amp;#x677F;&amp;#xFF08;&lt;a href=&quot;https://media-mediatemple.netdna-ssl.com/wp-content/uploads/2016/03/04-colour-lovers-palettes-opt.jpg&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x5927;&amp;#x56FE;&lt;/a&gt;&amp;#xFF09;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x8FD9;&amp;#x79CD;&amp;#x8C03;&amp;#x8272;&amp;#x677F;&amp;#x7684;&amp;#x4E3B;&amp;#x8981;&amp;#x95EE;&amp;#x9898;&amp;#x662F;&amp;#x5E94;&amp;#x7528;&amp;#x5230;&amp;#x5B9E;&amp;#x9645;&amp;#x8BBE;&amp;#x8BA1;&amp;#x65F6;&amp;#x4E0D;&amp;#x592A;&amp;#x5B9E;&amp;#x9645;&amp;#x3002;&amp;#x5F88;&amp;#x591A;&amp;#x8C03;&amp;#x8272;&amp;#x677F;&amp;#x6709;&amp;#x6BD4;&amp;#x4F60;&amp;#x60F3;&amp;#x8981;&amp;#x7684;&amp;#x591A;&amp;#x5F97;&amp;#x591A;&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#xFF0C;&amp;#x5C24;&amp;#x5176;&amp;#x662F;&amp;#x8003;&amp;#x8651;&amp;#x5230;&amp;#x5E73;&amp;#x5747;&amp;#x4E00;&amp;#x4E2A;&amp;#x914D;&amp;#x8272;&amp;#x65B9;&amp;#x6848;&amp;#x53EA;&amp;#x9700;&amp;#x8981;3&amp;#x4E2A;&amp;#x4E2D;&amp;#x6027;&amp;#x8272;&amp;#xFF1A;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#x767D;&amp;#x8272;&lt;/li&gt;
&lt;li&gt;&amp;#x6DF1;&amp;#x7070;&amp;#x8272;&lt;/li&gt;
&lt;li&gt;&amp;#x6D45;&amp;#x7070;&amp;#x8272;&amp;#xFF08;&amp;#x53EF;&amp;#x9009;&amp;#xFF09;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#x5982;&amp;#x679C;&amp;#x4F60;&amp;#x8BD5;&amp;#x7740;&amp;#x6DFB;&amp;#x52A0;5&amp;#x6216;6&amp;#x4E2A;&amp;#x4E2D;&amp;#x6027;&amp;#x8272;&amp;#xFF0C;&amp;#x5C31;&amp;#x51CC;&amp;#x4E71;&amp;#x4E86;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x771F;&amp;#x6B63;&amp;#x9700;&amp;#x8981;&amp;#x7684;&amp;#x4E24;&amp;#x79CD;&amp;#x989C;&amp;#x8272;&amp;#xFF1A;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#x4E00;&amp;#x4E2A;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&amp;#xFF08;&amp;#x6211;&amp;#x4EEC;&amp;#x7684;&amp;#x4F8B;&amp;#x5B50;&amp;#x4E2D;&amp;#x662F;&lt;code&gt;#30c9e8&lt;/code&gt;&amp;#xFF09;&lt;/li&gt;
&lt;li&gt;&amp;#x4E00;&amp;#x4E2A;&amp;#x5F3A;&amp;#x8C03;&amp;#x8272;&amp;#xFF08;&amp;#x9A6C;&amp;#x4E0A;&amp;#x5C31;&amp;#x8BB2;&amp;#x5230;&amp;#x8FD9;&amp;#x4E2A;&amp;#xFF09;&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;&amp;#x6BD4;&amp;#x8D77;&amp;#x5927;&amp;#x8086;&amp;#x4F7F;&amp;#x7528;&amp;#x4E92;&amp;#x8865;&amp;#x8272;&amp;#x7CFB;&amp;#xFF0C;&amp;#x5206;&amp;#x6563;&amp;#x7684;&amp;#x4E92;&amp;#x8865;&amp;#x8272;&amp;#x7CFB;&amp;#xFF0C;&amp;#x4E09;&amp;#x8272;&amp;#x7CFB;&amp;#x548C;&amp;#x5176;&amp;#x4ED6;&amp;#x8272;&amp;#x7CFB;&amp;#xFF0C;&amp;#x4EC5;&amp;#x7528;&amp;#x8FD9;5&amp;#x79CD;&amp;#x989C;&amp;#x8272;&amp;#x521B;&amp;#x5EFA;&amp;#x7F51;&amp;#x7AD9;&amp;#xFF0C;&amp;#x4F60;&amp;#x4F1A;&amp;#x5F97;&amp;#x5230;&amp;#x66F4;&amp;#x597D;&amp;#x7684;&amp;#x6548;&amp;#x679C;&amp;#x3002;
&lt;img src=&quot;/images/05-simple-color-schemes-opt.jpg&quot; alt=&quot;image&quot;&gt;
&lt;em&gt;&amp;#x8C61;&lt;a href=&quot;https://thoughtbot.com/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Thoughtbot&lt;/a&gt;&amp;#x548C;&lt;a href=&quot;http://tedtoddinsurance.com/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;TedTodd&lt;/a&gt;&amp;#xFF0C;&amp;#x4E00;&amp;#x4E2A;&amp;#x597D;&amp;#x770B;&amp;#x7684;&amp;#x7F51;&amp;#x7AD9;&amp;#x4E0D;&amp;#x9700;&amp;#x8981;&amp;#x590D;&amp;#x6742;&amp;#x7684;&amp;#x914D;&amp;#x8272;&amp;#x65B9;&amp;#x6848;&amp;#x3002;&amp;#xFF08;&lt;a href=&quot;https://media-mediatemple.netdna-ssl.com/wp-content/uploads/2016/03/05-simple-color-schemes-opt.jpg&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x5927;&amp;#x56FE;&lt;/a&gt;&amp;#xFF09;&lt;/em&gt;&lt;/p&gt;
&lt;h3 id=&quot;&amp;#x5BFB;&amp;#x627E;&amp;#x5F3A;&amp;#x8C03;&amp;#x8272;&quot;&gt;&amp;#x5BFB;&amp;#x627E;&amp;#x5F3A;&amp;#x8C03;&amp;#x8272;&lt;/h3&gt;
&lt;p&gt;&amp;#x5F3A;&amp;#x8C03;&amp;#x8272;&amp;#x5728;&amp;#x7F51;&amp;#x7AD9;&amp;#x4E0A;&amp;#x4F1A;&amp;#x5C11;&amp;#x91CF;&amp;#x4F7F;&amp;#x7528;&amp;#xFF0C;&amp;#x901A;&amp;#x5E38;&amp;#x7528;&amp;#x5728;&amp;#x884C;&amp;#x4E3A;&amp;#x53EC;&amp;#x5524;&amp;#xFF08;&amp;#x5982;&amp;#xFF1A;&amp;#x8D2D;&amp;#x4E70;&amp;#x3001;&amp;#x4E0B;&amp;#x8F7D;&amp;#x6309;&amp;#x94AE;&amp;#xFF0C;&amp;#x8BD1;&amp;#x8005;&amp;#x6CE8;&amp;#xFF09;&amp;#x9875;&amp;#x9762;&amp;#x5143;&amp;#x7D20;&amp;#x4E0A;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#x9700;&amp;#x8981;&amp;#x5F15;&amp;#x4EBA;&amp;#x6CE8;&amp;#x76EE;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x4E0B;&amp;#x4E00;&amp;#x6B65;&amp;#xFF0C;&amp;#x628A;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&amp;#x7684;16&amp;#x8FDB;&amp;#x5236;&amp;#x503C;&amp;#x8F93;&amp;#x5165;&lt;a href=&quot;http://paletton.com/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Paletton&lt;/a&gt; &amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#x503C;&amp;#x65B9;&amp;#x6846;&amp;#x4E2D;&amp;#xFF1A;
&lt;img src=&quot;/images/06-base-rgb-opt.jpg&quot; alt=&quot;image&quot;&gt;
&lt;em&gt;&amp;#x5728;Paletton&amp;#x4E0A;&amp;#x8F93;&amp;#x5165;&amp;#x4F60;&amp;#x7684;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&amp;#xFF08;&lt;a href=&quot;https://media-mediatemple.netdna-ssl.com/wp-content/uploads/2016/03/06-base-rgb-opt.jpg&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x5927;&amp;#x56FE;&lt;/a&gt;&amp;#xFF09;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x8FD9;&amp;#x91CC;&amp;#xFF0C;&amp;#x53EF;&amp;#x7528;&amp;#x4E24;&amp;#x79CD;&amp;#x65B9;&amp;#x5F0F;&amp;#x627E;&amp;#x5230;&amp;#x5F3A;&amp;#x8C03;&amp;#x8272;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x9996;&amp;#x5148;&amp;#xFF0C;&amp;#x70B9;&amp;#x51FB;&amp;#x201C;Add Complementary&amp;#x201D;&amp;#x6309;&amp;#x94AE;&amp;#xFF0C;&amp;#x5623;&amp;#xFF01;&amp;#x90A3;&amp;#x662F;&amp;#x6A59;&amp;#x8272;&amp;#xFF1F;&amp;#x90A3;&amp;#x5C31;&amp;#x662F;&amp;#x4F60;&amp;#x7684;&amp;#x5F3A;&amp;#x8C03;&amp;#x8272;&amp;#x3002;
&lt;img src=&quot;/images/07-complimentary-opt.jpg&quot; alt=&quot;image&quot;&gt;
&lt;em&gt;Paletton&amp;#x81EA;&amp;#x52A8;&amp;#x751F;&amp;#x6210;&amp;#x4E00;&amp;#x4E2A;&amp;#x597D;&amp;#x7684;&amp;#x5F3A;&amp;#x8C03;&amp;#x8272;&amp;#xFF08;&lt;a href=&quot;https://media-mediatemple.netdna-ssl.com/wp-content/uploads/2016/03/07-complimentary-opt.jpg&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x5927;&amp;#x56FE;&lt;/a&gt;&amp;#xFF09;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x6216;&amp;#x8005;&amp;#xFF0C;&amp;#x5982;&amp;#x679C;&amp;#x4F60;&amp;#x4E0D;&amp;#x559C;&amp;#x6B22;&amp;#x751F;&amp;#x6210;&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#xFF0C;&amp;#x53EF;&amp;#x4EE5;&amp;#x70B9;&amp;#x51FB;&amp;#x4F4D;&amp;#x4E8E;&amp;#x9876;&amp;#x90E8;&amp;#x7684;&amp;#x51E0;&amp;#x4E2A;&amp;#x6309;&amp;#x94AE;&amp;#x6765;&amp;#x53D1;&amp;#x73B0;&amp;#x66F4;&amp;#x597D;&amp;#x7684;&amp;#x3002;
&lt;img src=&quot;/images/08-triad-opt.jpg&quot; alt=&quot;image&quot;&gt;
&lt;em&gt;&amp;#x70B9;&amp;#x51FB;&amp;#x4EE5;&amp;#x53D1;&amp;#x73B0;&amp;#x559C;&amp;#x6B22;&amp;#x7684;&amp;#x8272;&amp;#x7CFB;&amp;#xFF08;&lt;a href=&quot;https://media-mediatemple.netdna-ssl.com/wp-content/uploads/2016/03/08-triad-opt.jpg&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x5927;&amp;#x56FE;&lt;/a&gt;&amp;#xFF09;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x5C31;&amp;#x672C;&amp;#x4EBA;&amp;#x800C;&amp;#x8A00;&amp;#xFF0C;&amp;#x6211;&amp;#x5341;&amp;#x5206;&amp;#x559C;&amp;#x6B22;&amp;#x4E09;&amp;#x8272;&amp;#x7CFB;&amp;#x6309;&amp;#x94AE;&amp;#xFF08;Triad&amp;#x6309;&amp;#x94AE;&amp;#xFF09;&amp;#x751F;&amp;#x6210;&amp;#x7684;&amp;#x7EA2;&amp;#x8272;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#x6211;&amp;#x4F1A;&amp;#x7528;&amp;#x5728;&amp;#x6211;&amp;#x4EEC;&amp;#x7684;&amp;#x914D;&amp;#x8272;&amp;#x65B9;&amp;#x6848;&amp;#x4E2D;&amp;#x3002;Paletton&amp;#x5728;&amp;#x80CC;&amp;#x540E;&amp;#x6240;&amp;#x505A;&amp;#x7684;&amp;#x4E8B;&amp;#x60C5;&amp;#x5F53;&amp;#x7136;&amp;#x6709;&amp;#x79D1;&amp;#x5B66;&amp;#x7406;&amp;#x8BBA;&amp;#x4F9D;&amp;#x636E;&amp;#xFF0C;&amp;#x4F46;&amp;#x662F;&amp;#xFF0C;&amp;#x73B0;&amp;#x5728;&amp;#x5148;&amp;#x653E;&amp;#x4E00;&amp;#x653E;&amp;#x3002;&amp;#x7A0D;&amp;#x540E;&amp;#x4F60;&amp;#x4F1A;&amp;#x5B66;&amp;#x5230;&amp;#x5176;&amp;#x7406;&amp;#x8BBA;&amp;#xFF0C;&amp;#x6240;&amp;#x6709;&amp;#x7684;&amp;#x4E8B;&amp;#x60C5;&amp;#x90FD;&amp;#x4F1A;&amp;#x53D8;&amp;#x5F97;&amp;#x6E05;&amp;#x6670;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x5DF2;&amp;#x7ECF;&amp;#x6709;&amp;#x4E86;&amp;#x6F02;&amp;#x4EAE;&amp;#x7684;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&amp;#xFF0C;&amp;#x914D;&amp;#x76EE;&amp;#x7684;&amp;#x5F3A;&amp;#x8C03;&amp;#x8272;&amp;#xFF0C;&amp;#x8BA9;&amp;#x6211;&amp;#x4EEC;&amp;#x52A0;&amp;#x5165;&amp;#x767D;&amp;#x8272;&amp;#xFF0C;&amp;#x56E0;&amp;#x4E3A;&amp;#x767D;&amp;#x8272;&amp;#x4E00;&amp;#x76F4;&amp;#x90FD;&amp;#x597D;&amp;#x642D;&amp;#x914D;&amp;#x3002;&amp;#x4E0B;&amp;#x9762;&amp;#x662F;&amp;#x6211;&amp;#x4EEC;&amp;#x73B0;&amp;#x5728;&amp;#x7684;&amp;#x914D;&amp;#x8272;&amp;#x65B9;&amp;#x6848;&amp;#xFF1A;
&lt;img src=&quot;/images/09-color-scheme-opt.jpg&quot; alt=&quot;image&quot;&gt;
&lt;em&gt;&amp;#x76EE;&amp;#x524D;&amp;#x7684;&amp;#x8C03;&amp;#x8272;&amp;#x677F;&amp;#xFF0C;&amp;#x6B63;&amp;#x5728;&amp;#x6210;&amp;#x5F62;&amp;#xFF08;&lt;a href=&quot;https://media-mediatemple.netdna-ssl.com/wp-content/uploads/2016/03/09-color-scheme-opt.jpg&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x5927;&amp;#x56FE;&lt;/a&gt;&amp;#xFF09;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x73B0;&amp;#x5728;&amp;#x7F3A;&amp;#x5931;&amp;#x7684;&amp;#x662F;&amp;#x4E00;&amp;#x4E9B;&amp;#x7070;&amp;#x8272;&amp;#x3002;&lt;/p&gt;
&lt;h3 id=&quot;&amp;#x6DFB;&amp;#x52A0;&amp;#x7070;&amp;#x8272;&quot;&gt;&amp;#x6DFB;&amp;#x52A0;&amp;#x7070;&amp;#x8272;&lt;/h3&gt;
&lt;p&gt;&amp;#x6211;&amp;#x7684;&amp;#x5927;&amp;#x591A;&amp;#x6570;&amp;#x9879;&amp;#x76EE;&amp;#x4E2D;&amp;#xFF0C;&amp;#x6211;&amp;#x53D1;&amp;#x73B0;&amp;#x4E24;&amp;#x79CD;&amp;#x8272;&amp;#x5EA6;&amp;#x7684;&amp;#x7070;&amp;#x8272;&amp;#x6C38;&amp;#x8FDC;&amp;#x6709;&amp;#x7528;&amp;#xFF0C;&amp;#x4E00;&amp;#x79CD;&amp;#x662F;&amp;#x6DF1;&amp;#x7070;&amp;#xFF0C;&amp;#x4E00;&amp;#x79CD;&amp;#x662F;&amp;#x6D45;&amp;#x7070;&amp;#x3002;&amp;#x4F60;&amp;#x4F1A;&amp;#x7ECF;&amp;#x5E38;&amp;#x7528;&amp;#x5230;&amp;#x5B83;&amp;#x4EEC;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x6DF1;&amp;#x7070;&amp;#x4E00;&amp;#x822C;&amp;#x7528;&amp;#x4E8E;&amp;#x6587;&amp;#x672C;&amp;#xFF0C;&amp;#x5F53;&amp;#x9700;&amp;#x8981;&amp;#x4E0E;&amp;#x767D;&amp;#x8272;&amp;#x533A;&amp;#x57DF;&amp;#x6709;&amp;#x4E9B;&amp;#x7EC6;&amp;#x5FAE;&amp;#x5DEE;&amp;#x522B;&amp;#x65F6;&amp;#x7528;&amp;#x5230;&amp;#x6D45;&amp;#x7070;&amp;#xFF08;&amp;#x4E00;&amp;#x822C;&amp;#x662F;&amp;#x80CC;&amp;#x666F;&amp;#xFF09;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x53EF;&amp;#x4EE5;&amp;#x901A;&amp;#x8FC7;&amp;#x4E24;&amp;#x79CD;&amp;#x65B9;&amp;#x5F0F;&amp;#x9009;&amp;#x62E9;&amp;#x7070;&amp;#x8272;&amp;#xFF1A;&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&amp;#x518D;&amp;#x6B21;&amp;#x7528;&amp;#x5230;&lt;a href=&quot;https://dribbble.com/colors/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Dribbble&lt;/a&gt;&amp;#x548C;&lt;a href=&quot;http://designspiration.net/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Designspiration&lt;/a&gt;&amp;#xFF0C;&amp;#x4ECE;&amp;#x4E4B;&amp;#x524D;&amp;#x5339;&amp;#x914D;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&amp;#x7684;&amp;#x641C;&amp;#x7D22;&amp;#x7ED3;&amp;#x679C;&amp;#x4E2D;&amp;#x627E;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E0D;&amp;#x9519;&amp;#x7684;&amp;#x7070;&amp;#x8272;&amp;#x3002;&amp;#x4F46;&amp;#x5728;&amp;#x641C;&amp;#x7D22;&amp;#x6761;&amp;#x4E2D;&amp;#x8F93;&amp;#x5165;&lt;code&gt;blue website&lt;/code&gt;&amp;#xFF0C;&amp;#x4F1A;&amp;#x6709;&amp;#x66F4;&amp;#x591A;&amp;#x6709;&amp;#x5173;&amp;#x7070;&amp;#x8272;&amp;#x7684;&amp;#x7ED3;&amp;#x679C;&amp;#xFF1B;&lt;/li&gt;
&lt;li&gt;&amp;#x5982;&amp;#x679C;&amp;#x6709;Photoshop&amp;#x6216;&amp;#x7C7B;&amp;#x4F3C;&amp;#x7684;&amp;#x8F6F;&amp;#x4EF6;&amp;#xFF0C;&amp;#x53EF;&amp;#x4EE5;&amp;#x7528;&lt;a href=&quot;http://methodandcraft.com/videos/creating-harmonious-color-schemes&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Erica Schoonmaker&amp;#x7684;&amp;#x6280;&amp;#x672F;&lt;/a&gt; &amp;#x548C;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&amp;#x6765;&amp;#x8C03;&amp;#x548C;&amp;#x7070;&amp;#x8272;&amp;#x3002;&lt;/li&gt;
&lt;/ul&gt;
&lt;h3 id=&quot;&amp;#x521B;&amp;#x5EFA;&amp;#x548C;&amp;#x8C10;&amp;#x7684;&amp;#x7070;&amp;#x8272;&quot;&gt;&amp;#x521B;&amp;#x5EFA;&amp;#x548C;&amp;#x8C10;&amp;#x7684;&amp;#x7070;&amp;#x8272;&lt;/h3&gt;
&lt;p&gt;&amp;#x4E3A;&amp;#x901A;&amp;#x8FC7;Erica&amp;#x7684;&amp;#x65B9;&amp;#x6CD5;&amp;#x53D6;&amp;#x5F97;&amp;#x6211;&amp;#x4EEC;&amp;#x53D1;&amp;#x4EAE;&amp;#x7684;&amp;#x65B0;&amp;#x548C;&amp;#x8C10;&amp;#x7070;&amp;#xFF0C;&amp;#x5148;&amp;#x968F;&amp;#x4FBF;&amp;#x9009;&amp;#x4E24;&amp;#x4E2A;&amp;#x9ED8;&amp;#x8BA4;&amp;#x7684;&amp;#x7070;&amp;#x8272;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x91C7;&amp;#x53D6;&amp;#x5982;&amp;#x4E0B;&amp;#x6B65;&amp;#x9AA4;&amp;#xFF1A;&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;&amp;#x521B;&amp;#x5EFA;&amp;#x4E24;&amp;#x4E2A;&amp;#x8272;&amp;#x5EA6;&amp;#x7684;&amp;#x7070;&amp;#x8272;&amp;#xFF0C;&lt;code&gt;#424242&lt;/code&gt;&amp;#x548C;&lt;code&gt;#fafafa&lt;/code&gt;&lt;/li&gt;
&lt;li&gt;&amp;#x5728;&amp;#x4E24;&amp;#x4E2A;&amp;#x8272;&amp;#x5EA6;&amp;#x4E0A;&amp;#x63D2;&amp;#x5165;&amp;#x4E00;&amp;#x4E2A;&amp;#x989C;&amp;#x8272;&amp;#x586B;&amp;#x5145;&amp;#x5C42;&lt;/li&gt;
&lt;li&gt;&amp;#x628A;&amp;#x586B;&amp;#x5145;&amp;#x5C42;&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#x6539;&amp;#x6210;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&amp;#xFF08;&lt;code&gt;#30c9e8&lt;/code&gt;&amp;#xFF09;&lt;/li&gt;
&lt;li&gt;&amp;#x8BBE;&amp;#x7F6E;&amp;#x56FE;&amp;#x5C42;&amp;#x7684;&amp;#x6DF7;&amp;#x5408;&amp;#x6A21;&amp;#x5F0F;&amp;#x4E3A;&amp;#x53E0;&amp;#x52A0;&amp;#xFF0C;&amp;#x628A;&amp;#x4E0D;&amp;#x900F;&amp;#x660E;&amp;#x5EA6;&amp;#x964D;&amp;#x5230;5%&amp;#x5230;40%&amp;#x95F4;&amp;#xFF08;&amp;#x672C;&amp;#x4F8B;&amp;#x662F;40%&amp;#xFF09;&lt;/li&gt;
&lt;li&gt;&amp;#x4F7F;&amp;#x7528;&amp;#x989C;&amp;#x8272;&amp;#x62FE;&amp;#x53D6;&amp;#x5668;&amp;#x5E76;&amp;#x62F7;&amp;#x8D1D;&amp;#x65B0;&amp;#x7684;&amp;#x989C;&amp;#x8272;&lt;/li&gt;
&lt;/ol&gt;
&lt;iframe src=&quot;https://player.vimeo.com/video/159766011&quot; width=&quot;500&quot; height=&quot;279&quot; frameborder=&quot;0&quot; title=&quot;nice-greys&quot; webkitallowfullscreen=&quot;&quot; mozallowfullscreen=&quot;&quot; allowfullscreen&gt;&lt;/iframe&gt;
&lt;p&gt;&amp;#x6211;&amp;#x9700;&amp;#x8981;&amp;#x6307;&amp;#x51FA;&amp;#x5F53;&amp;#x53E0;&amp;#x52A0;&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#x662F;&amp;#x84DD;&amp;#x8272;&amp;#x65F6;&amp;#x8FD9;&amp;#x4E2A;&amp;#x65B9;&amp;#x6CD5;&amp;#x5DE5;&amp;#x4F5C;&amp;#x5F97;&amp;#x683C;&amp;#x5916;&amp;#x597D;&amp;#xFF0C;&amp;#x5BF9;&amp;#x4E8E;&amp;#x5176;&amp;#x4ED6;&amp;#x989C;&amp;#x8272;&amp;#xFF0C;&amp;#x8981;&amp;#x4E48;&amp;#x628A;&amp;#x4E0D;&amp;#x900F;&amp;#x660E;&amp;#x5EA6;&amp;#x964D;&amp;#x5230;5%&amp;#x81F3;10%&amp;#xFF0C;&amp;#x8981;&amp;#x4E48;&amp;#x575A;&amp;#x6301;&amp;#x539F;&amp;#x6765;&amp;#x7684;&amp;#x7070;&amp;#x8272;&amp;#x3002;
&lt;img src=&quot;/images/10-greys-opt.jpg&quot; alt=&quot;image&quot;&gt;
&lt;em&gt;&amp;#x6311;&amp;#x9009;&amp;#x8C03;&amp;#x548C;&amp;#x4E86;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&amp;#x7684;&amp;#x7070;&amp;#x8272;&amp;#x662F;&amp;#x4E2A;&amp;#x9020;&amp;#x5C31;&amp;#x5927;&amp;#x4E0D;&amp;#x540C;&amp;#x7684;&amp;#x5C0F;&amp;#x4E8B;&amp;#xFF08;&lt;a href=&quot;https://media-mediatemple.netdna-ssl.com/wp-content/uploads/2016/03/10-greys-opt.jpg&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x5927;&amp;#x56FE;&lt;/a&gt;&amp;#xFF09;&lt;/em&gt;&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x77A7;&amp;#x6211;&amp;#x4EEC;&amp;#x505A;&amp;#x5230;&amp;#x4E86;&quot;&gt;&amp;#x77A7;&amp;#xFF01;&amp;#x6211;&amp;#x4EEC;&amp;#x505A;&amp;#x5230;&amp;#x4E86;&amp;#xFF01;&lt;/h2&gt;
&lt;p&gt;&amp;#x6211;&amp;#x4EEC;&amp;#x7684;&amp;#x914D;&amp;#x8272;&amp;#x65B9;&amp;#x6848;&amp;#x5B8C;&amp;#x6210;&amp;#x4E86;&amp;#x3002;&amp;#x5E0C;&amp;#x671B;&amp;#x4F60;&amp;#x611F;&amp;#x5230;&amp;#x81EA;&amp;#x8C6A;&amp;#xFF0C;&amp;#x6211;&amp;#x76F8;&amp;#x4FE1;&amp;#x4F1A;&amp;#x5982;&amp;#x6B64;&amp;#x3002;&amp;#x8FD9;&amp;#x5C31;&amp;#x662F;&amp;#x4E86;&amp;#xFF0C;&amp;#x5149;&amp;#x5F69;&amp;#x593A;&amp;#x76EE;&amp;#xFF1A;
&lt;img src=&quot;/images/11-color-palette-opt.jpg&quot; alt=&quot;image&quot;&gt;
&lt;em&gt;&amp;#x6F02;&amp;#x4EAE;&amp;#x7684;&amp;#x914D;&amp;#x8272;&amp;#x65B9;&amp;#x6848;&amp;#xFF0C;&amp;#x80FD;&amp;#x7528;&amp;#x4E86;&lt;/em&gt;&amp;#xFF08;&lt;a href=&quot;https://media-mediatemple.netdna-ssl.com/wp-content/uploads/2016/03/11-color-palette-opt.jpg&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x5927;&amp;#x56FE;&lt;/a&gt;&amp;#xFF09;&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x5E94;&amp;#x7528;&amp;#x914D;&amp;#x8272;&amp;#x65B9;&amp;#x6848;&quot;&gt;&amp;#x5E94;&amp;#x7528;&amp;#x914D;&amp;#x8272;&amp;#x65B9;&amp;#x6848;&lt;/h2&gt;
&lt;p&gt;&amp;#x73B0;&amp;#x5728;&amp;#x6211;&amp;#x4EEC;&amp;#x5DF2;&amp;#x7ECF;&amp;#x5F97;&amp;#x5230;&amp;#x4E86;&amp;#x914D;&amp;#x8272;&amp;#x65B9;&amp;#x6848;&amp;#xFF0C;&amp;#x5230;&amp;#x7528;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#x4E86;&amp;#x3002;&amp;#x8FD9;&amp;#x5B8C;&amp;#x5168;&amp;#x662F;&amp;#x53E6;&amp;#x4E00;&amp;#x4E2A;&amp;#x8BDD;&amp;#x9898;&amp;#x3002;&amp;#x4F46;&amp;#x4E3A;&amp;#x8BA9;&amp;#x4F60;&amp;#x6709;&amp;#x6240;&amp;#x4E86;&amp;#x89E3;&amp;#xFF0C;&amp;#x8FD9;&amp;#x91CC;&amp;#x6709;&amp;#x4E00;&amp;#x4E2A;&amp;#x7070;&amp;#x5EA6;&amp;#x8BBE;&amp;#x8BA1;&amp;#x7A3F;&amp;#x548C;&amp;#x4E00;&amp;#x4E2A;&amp;#x7740;&amp;#x8272;&amp;#x540E;&amp;#x7684;&amp;#x7248;&amp;#x672C;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x5C0F;&amp;#x8D34;&amp;#x58EB;&amp;#xFF1A;&amp;#x5982;&amp;#x679C;&amp;#x4F60;&amp;#x7EA0;&amp;#x7ED3;&amp;#x4E8E;&amp;#x989C;&amp;#x8272;&amp;#xFF0C;&amp;#x4E00;&amp;#x4E2A;&amp;#x4E0D;&amp;#x9519;&amp;#x7684;&amp;#x6280;&amp;#x5DE7;&amp;#x662F;&amp;#x5148;&amp;#x7528;&amp;#x7070;&amp;#x5EA6;&amp;#x6A21;&amp;#x5F0F;&amp;#x521B;&amp;#x5EFA;&amp;#x7F51;&amp;#x7AD9;&amp;#x7684;&amp;#x5E03;&amp;#x5C40;&amp;#xFF0C;&amp;#x5F04;&amp;#x6E05;&amp;#x5C42;&amp;#x6B21;&amp;#x7ED3;&amp;#x6784;&amp;#xFF0C;&amp;#x518D;&amp;#x8BD5;&amp;#x7528;&amp;#x989C;&amp;#x8272;&amp;#x3002;
&lt;img src=&quot;/images/12-colour-in-practice-greyscale-opt.jpg&quot; alt=&quot;image&quot;&gt;
&lt;em&gt;&amp;#x4EE5;&amp;#x7070;&amp;#x5EA6;&amp;#x6A21;&amp;#x5F0F;&amp;#x5E03;&amp;#x5C40;&amp;#x7F51;&amp;#x7AD9;&amp;#x6709;&amp;#x5229;&amp;#x4E8E;&amp;#x5E94;&amp;#x7528;&amp;#x914D;&amp;#x8272;&amp;#x65B9;&amp;#x6848;&lt;/em&gt;&amp;#xFF08;&lt;a href=&quot;https://media-mediatemple.netdna-ssl.com/wp-content/uploads/2016/03/12-colour-in-practice-greyscale-opt.jpg&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x5927;&amp;#x56FE;&lt;/a&gt;&amp;#xFF09;
&lt;img src=&quot;/images/13-color-in-practice-opt.jpg&quot; alt=&quot;image&quot;&gt;
&lt;em&gt;&amp;#x7740;&amp;#x8272;&amp;#x540E;&amp;#x7684;&amp;#x7248;&amp;#x672C;&lt;/em&gt;&amp;#xFF08;&lt;a href=&quot;https://media-mediatemple.netdna-ssl.com/wp-content/uploads/2016/03/13-color-in-practice-opt.jpg&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x5927;&amp;#x56FE;&lt;/a&gt;&amp;#xFF09;&lt;/p&gt;
&lt;p&gt;&amp;#x5982;&amp;#x4F60;&amp;#x6240;&amp;#x89C1;&amp;#xFF0C;&amp;#x84DD;&amp;#x8272;&amp;#x662F;&amp;#x8FD9;&amp;#x91CC;&amp;#x7684;&amp;#x7279;&amp;#x5F81;&amp;#x8272;&amp;#xFF0C;&amp;#x5927;&amp;#x9762;&amp;#x79EF;&amp;#x5730;&amp;#x4F7F;&amp;#x7528;&amp;#xFF0C;&amp;#x4E5F;&amp;#x7528;&amp;#x5728;&amp;#x56FE;&amp;#x6807;&amp;#x4E2D;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x6211;&amp;#x4EEC;&amp;#x7684;&amp;#x5F3A;&amp;#x8C03;&amp;#x8272;&amp;#xFF0C;&amp;#x7EA2;&amp;#x8272;&amp;#xFF0C;&amp;#x76F8;&amp;#x5BF9;&amp;#x4E8E;&amp;#x57FA;&amp;#x672C;&amp;#x8272;&amp;#x5B83;&amp;#x5F15;&amp;#x4EBA;&amp;#x6CE8;&amp;#x76EE;&amp;#xFF0C;&amp;#x5C0F;&amp;#x9762;&amp;#x79EF;&amp;#x5730;&amp;#x4F7F;&amp;#x7528;&amp;#xFF0C;&amp;#x7528;&amp;#x5728;&amp;#x6309;&amp;#x94AE;&amp;#x4E0A;&amp;#x548C;&amp;#x56FE;&amp;#x6807;&amp;#x4E2D;&amp;#x3002;&amp;#x8FD9;&amp;#x4E2A;&amp;#x7EA2;&amp;#x8272;&amp;#x7528;&amp;#x7684;&amp;#x8D8A;&amp;#x5C11;&amp;#xFF0C;&amp;#x8D8A;&amp;#x663E;&amp;#x5F97;&amp;#x593A;&amp;#x76EE;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x6DF1;&amp;#x7070;&amp;#x7528;&amp;#x5728;&amp;#x6587;&amp;#x672C;&amp;#xFF0C;LOGO&amp;#x548C;&amp;#x56FE;&amp;#x6807;&amp;#x7684;&amp;#x8F6E;&amp;#x5ED3;&amp;#x3002;&amp;#x56FE;&amp;#x6807;&amp;#x4E2D;&amp;#x522B;&amp;#x4E0D;&amp;#x653E;&amp;#x8FD9;&amp;#x79CD;&amp;#x989C;&amp;#x8272;&amp;#xFF0C;&amp;#x5C0F;&amp;#x7EC6;&amp;#x8282;&amp;#x9020;&amp;#x5C31;&amp;#x5927;&amp;#x4E0D;&amp;#x540C;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x80CC;&amp;#x666F;&amp;#x4F7F;&amp;#x7528;&amp;#x767D;&amp;#x8272;&amp;#x548C;&amp;#x6D45;&amp;#x7070;&amp;#x8272;&amp;#x3002;&amp;#x6D45;&amp;#x7070;&amp;#x8272;&amp;#x6839;&amp;#x672C;&amp;#x4E0D;&amp;#x9700;&amp;#x8981;&amp;#xFF0C;&amp;#x4F46;&amp;#x6211;&amp;#x53D1;&amp;#x73B0;&amp;#x8FD9;&amp;#x662F;&amp;#x53E6;&amp;#x5916;&amp;#x4E00;&amp;#x4E2A;&amp;#x80FD;&amp;#x8BA9;&amp;#x7F51;&amp;#x7AD9;&amp;#x8D4F;&amp;#x5FC3;&amp;#x60A6;&amp;#x76EE;&amp;#x7684;&amp;#x5C0F;&amp;#x7EC6;&amp;#x8282;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x5F53;&amp;#x4F7F;&amp;#x7528;&amp;#x989C;&amp;#x8272;&amp;#x548C;&amp;#x6587;&amp;#x672C;&amp;#x65F6;&amp;#xFF0C;&amp;#x786E;&amp;#x4FDD;&amp;#x80CC;&amp;#x666F;&amp;#x548C;&amp;#x6587;&amp;#x672C;&amp;#x6709;&amp;#x8DB3;&amp;#x591F;&amp;#x7684;&amp;#x5BF9;&amp;#x6BD4;&amp;#x662F;&amp;#x5F88;&amp;#x91CD;&amp;#x8981;&amp;#x7684;&amp;#xFF0C;&amp;#x8FD9;&amp;#x6709;&amp;#x52A9;&amp;#x4E8E;&amp;#x8272;&amp;#x76F2;&amp;#x548C;&amp;#x4F4E;&amp;#x89C6;&amp;#x529B;&amp;#x8005;&amp;#x9605;&amp;#x8BFB;&amp;#x4F60;&amp;#x7F51;&amp;#x7AD9;&amp;#x4E0A;&amp;#x7684;&amp;#x6587;&amp;#x5B57;&amp;#x3002;&amp;#x6709;&amp;#x8BB8;&amp;#x591A;&amp;#x5DE5;&amp;#x5177;&amp;#x53EF;&amp;#x7528;&amp;#x4E8E;&amp;#x67E5;&amp;#x5BFB;&amp;#x9075;&amp;#x5B88;&lt;a href=&quot;http://webaim.org/blog/wcag-2-0-and-link-colors/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;WCAG&amp;#x51C6;&amp;#x5219;&lt;/a&gt;&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#x3002;&amp;#x4E24;&amp;#x4E2A;&amp;#x6D41;&amp;#x884C;&amp;#x7684;&amp;#x5DE5;&amp;#x5177;&amp;#x662F;&lt;a href=&quot;http://webaim.org/resources/contrastchecker/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;WebAim Color Contrast Checker&lt;/a&gt;&amp;#x548C;&lt;a href=&quot;http://lea.verou.me/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Lea Verou&lt;/a&gt;&amp;#x5199;&amp;#x7684;&lt;a href=&quot;http://leaverou.github.io/contrast-ratio/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Contrast Ratio&lt;/a&gt; &amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x7ED3;&amp;#x8BED;&quot;&gt;&amp;#x7ED3;&amp;#x8BED;&lt;/h2&gt;
&lt;p&gt;&amp;#x5982;&amp;#x4F60;&amp;#x6240;&amp;#x89C1;&amp;#xFF0C;&amp;#x9664;&amp;#x4E86;&amp;#x4ECA;&amp;#x5929;&amp;#x521B;&amp;#x5EFA;&amp;#x7684;&amp;#x8C03;&amp;#x8272;&amp;#x677F;&amp;#x4E2D;&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x771F;&amp;#x5F97;&amp;#x4E0D;&amp;#x9700;&amp;#x8981;&amp;#x592A;&amp;#x591A;&amp;#xFF0C;&amp;#x4F46;&amp;#x4E0D;&amp;#x610F;&amp;#x5473;&amp;#x7740;&amp;#x4F60;&amp;#x5C40;&amp;#x9650;&amp;#x4E8E;&amp;#x6B64;&amp;#xFF0C;&amp;#x5662;&amp;#xFF0C;&amp;#x4E0D;&amp;#xFF01;
&lt;img src=&quot;/images/14-color-palette-extended-opt.jpg&quot; alt=&quot;image&quot;&gt;
&lt;em&gt;&amp;#x4F7F;&amp;#x7528;&amp;#x4E0A;&amp;#x8FF0;&amp;#x6280;&amp;#x672F;&amp;#xFF0C;&amp;#x5F53;&amp;#x4F60;&amp;#x9700;&amp;#x8981;&amp;#x65F6;&amp;#xFF0C;&amp;#x4F60;&amp;#x80FD;&amp;#x6269;&amp;#x5C55;&amp;#x4F60;&amp;#x7684;&amp;#x8C03;&amp;#x8272;&amp;#x677F;&amp;#x6765;&amp;#x638C;&amp;#x63A7;&amp;#x66F4;&amp;#x591A;&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#xFF08;&lt;a href=&quot;https://media-mediatemple.netdna-ssl.com/wp-content/uploads/2016/03/14-color-palette-extended-opt.jpg&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x5927;&amp;#x56FE;&lt;/a&gt;&amp;#xFF09;&lt;/em&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x8BBE;&amp;#x8BA1;&amp;#x65F6;&amp;#xFF0C;&amp;#x4F60;&amp;#x6216;&amp;#x8BB8;&amp;#x5224;&amp;#x5B9A;&amp;#x5F15;&amp;#x5165;&amp;#x66F4;&amp;#x591A;&amp;#x989C;&amp;#x8272;&amp;#x8FDB;&amp;#x8C03;&amp;#x8272;&amp;#x677F;&amp;#x662F;&amp;#x9002;&amp;#x5F53;&amp;#x7684;&amp;#xFF0C;&amp;#x8FD9;&amp;#x7EDD;&amp;#x5BF9;&amp;#x53EF;&amp;#x4EE5;&amp;#xFF01;&amp;#x53EA;&amp;#x8981;&amp;#x7EC6;&amp;#x5FC3;&amp;#xFF0C;&amp;#x80FD;&amp;#x7528;&amp;#x4E0A;&amp;#x8FF0;&amp;#x6B65;&amp;#x9AA4;&amp;#x627E;&amp;#x51FA;&amp;#x66F4;&amp;#x591A;&amp;#x80FD;&amp;#x4E0E;&amp;#x4F60;&amp;#x7684;&amp;#x914D;&amp;#x8272;&amp;#x65B9;&amp;#x6848;&amp;#x4E00;&amp;#x8D77;&amp;#x5DE5;&amp;#x4F5C;&amp;#x7684;&amp;#x989C;&amp;#x8272;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x7F8E;&amp;#x5999;&amp;#x7684;&amp;#x5730;&amp;#x65B9;&amp;#x5728;&amp;#x4E8E;&amp;#x8FD9;&amp;#x4E8B;&amp;#x4F60;&amp;#x505A;&amp;#x7684;&amp;#x8D8A;&amp;#x591A;&amp;#xFF0C;&amp;#x9009;&amp;#x62E9;&amp;#x989C;&amp;#x8272;&amp;#x65F6;&amp;#x4F60;&amp;#x5E72;&amp;#x7684;&amp;#x8D8A;&amp;#x597D;&amp;#xFF0C;&amp;#x4F60;&amp;#x4F1A;&amp;#x77E5;&amp;#x9053;&amp;#x54EA;&amp;#x4E9B;&amp;#x80FD;&amp;#x4E00;&amp;#x8D77;&amp;#x5DE5;&amp;#x4F5C;&amp;#xFF0C;&amp;#x54EA;&amp;#x4E9B;&amp;#x4E0D;&amp;#x80FD;&amp;#x3002;&amp;#x6709;&amp;#x65F6;&amp;#x4E0A;&amp;#x8FF0;&amp;#x65B9;&amp;#x6CD5;&amp;#x4EA7;&amp;#x51FA;&amp;#x7684;&amp;#x7ED3;&amp;#x679C;&amp;#x4E0D;&amp;#x5C3D;&amp;#x4E8E;&amp;#x4EBA;&amp;#x610F;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#x968F;&amp;#x65F6;&amp;#x8C03;&amp;#x6574;&amp;#x3002;&amp;#x5B66;&amp;#x4E60;&amp;#x989C;&amp;#x8272;&amp;#x7406;&amp;#x8BBA;&amp;#xFF0C;&amp;#x5374;&amp;#x4E0D;&amp;#x89C1;&amp;#x7406;&amp;#x8BBA;&amp;#xFF0C;&amp;#x73A9;&amp;#x513F;&amp;#x5F97;&amp;#x5F00;&amp;#x5FC3;&amp;#xFF01;&lt;/p&gt;
&lt;p&gt;&amp;#x539F;&amp;#x6587;&amp;#xFF1A;&lt;a href=&quot;https://www.smashingmagazine.com/2016/04/web-developer-guide-color/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;A Simple Web Developer&amp;#x2019;s Guide To Color&lt;/a&gt;&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;p&gt;我从来不是一个颜色理论的爱好者。我想是因为我对它一直不抱希望。我乐意坐在那儿，色环在手，选取互补色、分散的互补色、三色配色方案，让朋友、家人、客户印象深刻。&lt;/p&gt;
&lt;p&gt;说实话，颜色理论对我很遥远，尝试在项目中使用颜色时我从未发现它有用。有点讽刺，我发现，颜色的选择、运用得越好，背后的理论我越有更好的认识。&lt;/p&gt;
&lt;p&gt;当然，刚起步时理论并没有真正得帮助，对吧？这就是为什么，在这篇文章里，你不会看到一个单一的色环，相反，我会展示一个简单的你能用在下一个Web项目的颜色工作流。&lt;/p&gt;
    
    </summary>
    
    
      <category term="web design" scheme="http://lnxpgn.github.io/tags/web-design/"/>
    
      <category term="网页设计" scheme="http://lnxpgn.github.io/tags/%E7%BD%91%E9%A1%B5%E8%AE%BE%E8%AE%A1/"/>
    
      <category term="translation" scheme="http://lnxpgn.github.io/tags/translation/"/>
    
      <category term="翻译" scheme="http://lnxpgn.github.io/tags/%E7%BF%BB%E8%AF%91/"/>
    
  </entry>
  
  <entry>
    <title>如何使用CSS垂直对齐元素</title>
    <link href="http://lnxpgn.github.io/2016/03/06/how-to-vertically-align-elements-using-css/"/>
    <id>http://lnxpgn.github.io/2016/03/06/how-to-vertically-align-elements-using-css/</id>
    <published>2016-03-06T15:18:36.000Z</published>
    <updated>2016-05-05T14:01:50.000Z</updated>
    
    <content type="html">&lt;p&gt;&amp;#x4EFB;&amp;#x4F55;&amp;#x4E00;&amp;#x4E2A;Web&amp;#x5F00;&amp;#x53D1;&amp;#x4EBA;&amp;#x5458;&amp;#x90FD;&amp;#x4F1A;&amp;#x9047;&amp;#x5230;&amp;#x5782;&amp;#x76F4;&amp;#x5BF9;&amp;#x9F50;&amp;#x8FD9;&amp;#x4E2A;&amp;#x8001;&amp;#x95EE;&amp;#x9898;&amp;#x3002;&amp;#x6211;&amp;#x5728;Web&amp;#x9886;&amp;#x57DF;&amp;#x5DE5;&amp;#x4F5C;&amp;#x4E86;&amp;#x5C06;&amp;#x8FD1;&amp;#x4E00;&amp;#x5E74;&amp;#xFF0C;&amp;#x5DF2;&amp;#x7ECF;&amp;#x88AB;&amp;#x5BA2;&amp;#x6237;&amp;#x95EE;&amp;#x4E86;&amp;#x591A;&amp;#x6B21;&amp;#x201C;&amp;#x628A;&amp;#x8FD9;&amp;#x4E2A;&amp;#x5BF9;&amp;#x9F50;&amp;#x5230;&amp;#x7A97;&amp;#x53E3;&amp;#x4E2D;&amp;#x592E;&amp;#x201D;&amp;#x6216;&amp;#x201C;&amp;#x628A;&amp;#x90A3;&amp;#x4E2A;&amp;#x653E;&amp;#x5230;&amp;#x90A3;&amp;#x4E2A;&amp;#x7684;&amp;#x4E2D;&amp;#x90E8;&amp;#x201D;&amp;#x3002;&amp;#x4F7F;&amp;#x7528;CSS&amp;#x5BB9;&amp;#x6613;&amp;#x5B9E;&amp;#x73B0;&amp;#x6C34;&amp;#x5E73;&amp;#x5BF9;&amp;#x9F50;&amp;#xFF1A;&lt;/p&gt;
&lt;p&gt;&amp;#x5BF9;&amp;#x4E8E;&amp;#x5757;&amp;#x7EA7;&amp;#x5143;&amp;#x7D20;&amp;#xFF08;block-level element&amp;#xFF09;&lt;/p&gt;
&lt;figure class=&quot;highlight scss&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;attribute&quot;&gt;display&lt;/span&gt;: block; &lt;span class=&quot;attribute&quot;&gt;margin&lt;/span&gt;: &lt;span class=&quot;number&quot;&gt;0&lt;/span&gt; auto;&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt;&amp;#x5BF9;&amp;#x4E8E;&amp;#x5185;&amp;#x8054;&amp;#x5143;&amp;#x7D20;&amp;#xFF08;inline element&amp;#xFF0C;&amp;#x4E5F;&amp;#x53EB;&amp;#x884C;&amp;#x5185;&amp;#x5143;&amp;#x7D20;&amp;#xFF09;&lt;/p&gt;
&lt;figure class=&quot;highlight scss&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;attribute&quot;&gt;display&lt;/span&gt;: inline-block; &lt;span class=&quot;attribute&quot;&gt;text-align&lt;/span&gt;: center;&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x5782;&amp;#x76F4;&amp;#x5BF9;&amp;#x9F50;&amp;#x4E0D;&amp;#x80FD;&amp;#x8FD9;&amp;#x4E48;&amp;#x7B80;&amp;#x5355;&amp;#xFF1F;&amp;#x95EE;&amp;#x9898;&amp;#x5728;&amp;#x4E8E;&amp;#x7F51;&amp;#x7AD9;&amp;#x4F20;&amp;#x7EDF;&amp;#x4E0A;&amp;#x5E76;&amp;#x4E0D;&amp;#x662F;&amp;#x4E3A;&amp;#x4E86;&amp;#x5782;&amp;#x76F4;&amp;#x5BF9;&amp;#x9F50;&amp;#xFF0C;&amp;#x7F51;&amp;#x9875;&amp;#x662F;&amp;#x6A2A;&amp;#x5411;&amp;#x7F29;&amp;#x653E;&amp;#x7684;&amp;#xFF0C;&amp;#x9AD8;&amp;#x5EA6;&amp;#x6539;&amp;#x53D8;&amp;#x4EE5;&amp;#x9002;&amp;#x5E94;&amp;#x5185;&amp;#x5BB9;&amp;#x3002;&amp;#x6211;&amp;#x4EEC;&amp;#x5E78;&amp;#x8FD0;&amp;#x7684;&amp;#x662F;CSS&amp;#x6709;&amp;#x591A;&amp;#x79CD;&amp;#x65B9;&amp;#x6CD5;&amp;#x53EF;&amp;#x4EE5;&amp;#x7ED5;&amp;#x8FC7;&amp;#x8FD9;&amp;#x4E2A;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x6709;&amp;#x4E9B;&amp;#x65B9;&amp;#x6CD5;&amp;#x597D;&amp;#x4E8E;&amp;#x5176;&amp;#x4ED6;&amp;#xFF0C;&amp;#x6709;&amp;#x4E9B;&amp;#x5219;&amp;#x662F;&amp;#x5341;&amp;#x5206;&amp;#x7CDF;&amp;#x7CD5;&amp;#xFF0C;&amp;#x4E0D;&amp;#x5E94;&amp;#x8BE5;&amp;#x4F7F;&amp;#x7528;&amp;#x3002;&amp;#x8BB0;&amp;#x4F4F;&amp;#x8FD9;&amp;#x4E9B;&amp;#x90FD;&amp;#x662F;&amp;#x76F8;&amp;#x5BF9;&amp;#x7684;&amp;#xFF08;&amp;#x6709;&amp;#x65F6;&amp;#x662F;&amp;#x7EDD;&amp;#x5BF9;&amp;#x7684;&amp;#xFF09;&amp;#xFF0C;&amp;#x4E00;&amp;#x4E2A;&amp;#x53EF;&amp;#x4EE5;&amp;#x5728;&amp;#x67D0;&amp;#x79CD;&amp;#x60C5;&amp;#x51B5;&amp;#x4E0B;&amp;#x89E3;&amp;#x51B3;&amp;#x95EE;&amp;#x9898;&amp;#x7684;&amp;#x65B9;&amp;#x6CD5;&amp;#x53EF;&amp;#x80FD;&amp;#x4E0D;&amp;#x80FD;&amp;#x89E3;&amp;#x51B3;&amp;#x53E6;&amp;#x5916;&amp;#x4E00;&amp;#x79CD;&amp;#x60C5;&amp;#x51B5;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#x3002;&lt;/p&gt;
&lt;a id=&quot;more&quot;&gt;&lt;/a&gt;
&lt;h2 id=&quot;&amp;#x9996;&amp;#x5148;vertical-align&amp;#x5C5E;&amp;#x6027;&quot;&gt;&amp;#x9996;&amp;#x5148;&amp;#xFF0C;vertical-align&amp;#x5C5E;&amp;#x6027;&lt;/h2&gt;
&lt;p&gt;&amp;#x5F00;&amp;#x53D1;&amp;#x4EBA;&amp;#x5458;&amp;#x90FD;&amp;#x6709;&amp;#x8FD9;&amp;#x4E2A;&amp;#x65F6;&amp;#x5019;&amp;#xFF1A;&amp;#x9996;&amp;#x5148;&amp;#x53D1;&amp;#x73B0;&amp;#x4E86;vertical-align&amp;#x5C5E;&amp;#x6027;&amp;#xFF0C;&amp;#x51E0;&amp;#x5206;&amp;#x949F;&amp;#x540E;&amp;#x5219;&amp;#x7591;&amp;#x60D1;&amp;#x5B83;&amp;#x5230;&amp;#x5E95;&amp;#x6709;&amp;#x4EC0;&amp;#x4E48;&amp;#x542B;&amp;#x4E49;&amp;#xFF0C;&amp;#x7279;&amp;#x522B;&amp;#x662F;&amp;#x5728;&amp;#x4F7F;&amp;#x7528;&amp;#x8FD9;&amp;#x4E2A;&amp;#x5C5E;&amp;#x6027;&amp;#x540E;&amp;#x8BE5;&amp;#x6B7B;&amp;#x7684;&amp;#x5782;&amp;#x76F4;&amp;#x5BF9;&amp;#x9F50;&amp;#x4ECD;&amp;#x4E0D;&amp;#x594F;&amp;#x6548;&amp;#xFF01;&amp;#xFF01;&amp;#xFF01;&amp;#x7684;&amp;#x786E;&amp;#xFF0C;&amp;#x6211;&amp;#x4EEC;&amp;#x90FD;&amp;#x66FE;&amp;#x7ECF;&amp;#x4E0D;&amp;#x6B63;&amp;#x786E;&amp;#x5730;&amp;#x7528;&amp;#x5230;&amp;#x5B83;&amp;#xFF0C;&amp;#x4F46;&amp;#x518D;&amp;#x4E5F;&amp;#x4E0D;&amp;#x4F1A;&amp;#x4E86;&amp;#xFF01;&lt;/p&gt;
&lt;p&gt;vertical-align&amp;#x5C5E;&amp;#x6027;&amp;#x89C4;&amp;#x5B9A;&amp;#x4E86;&amp;#x6392;&amp;#x6210;&amp;#x4E00;&amp;#x884C;&amp;#x7684;&amp;#x5144;&amp;#x5F1F;&amp;#x5143;&amp;#x7D20;&amp;#x95F4;&amp;#x5F7C;&amp;#x6B64;&amp;#x662F;&amp;#x5982;&amp;#x4F55;&amp;#x5BF9;&amp;#x9F50;&amp;#x7684;&amp;#x3002;&amp;#x5B83;&amp;#x9002;&amp;#x7528;&amp;#x4E8E;&amp;#x5185;&amp;#x8054;&amp;#x5143;&amp;#x7D20;&amp;#xFF08;inline element&amp;#xFF09;&amp;#x548C;table cell&amp;#x5143;&amp;#x7D20;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x9002;&amp;#x7528;&amp;#x4E8E;&amp;#x5185;&amp;#x8054;&amp;#x5143;&amp;#x7D20;&amp;#x65F6;&amp;#x7684;&amp;#x503C;&amp;#xFF1A;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;baseline&lt;/strong&gt;&amp;#xFF1A;&amp;#x5C06;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x6587;&amp;#x672C;&amp;#x7684;&amp;#x57FA;&amp;#x7EBF;&amp;#xFF08;base line&amp;#xFF09;&amp;#x4E0E;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x57FA;&amp;#x7EBF;&amp;#x5BF9;&amp;#x9F50;&amp;#x3002;&amp;#x60F3;&amp;#x8C61;&amp;#x57FA;&amp;#x7EBF;&amp;#x5C31;&amp;#x662F;&amp;#x5E26;&amp;#x6709;&amp;#x6A2A;&amp;#x7EBF;&amp;#x7684;&amp;#x5199;&amp;#x4F5C;&amp;#x7EB8;&amp;#x4E0A;&amp;#x7684;&amp;#x6A2A;&amp;#x7EBF;&amp;#x3002;&amp;#x8FD9;&amp;#x662F;&amp;#x9ED8;&amp;#x8BA4;&amp;#x503C;&amp;#xFF1B;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;bottom&lt;/strong&gt;&amp;#xFF1A;&amp;#x5C06;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x5E95;&amp;#x90E8;&amp;#x4E0E;&lt;strong&gt;&lt;em&gt;&amp;#x884C;&lt;/em&gt;&lt;/strong&gt; &amp;#x7684;&amp;#x5E95;&amp;#x90E8;&amp;#x5BF9;&amp;#x9F50;&amp;#xFF1B;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;middle&lt;/strong&gt;&amp;#xFF1A;&amp;#x5C06;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x4E2D;&amp;#x5FC3;&amp;#x7EBF;&amp;#x4E0E;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x4E2D;&amp;#x5FC3;&amp;#x7EBF;&amp;#x5BF9;&amp;#x9F50;&amp;#xFF08;&amp;#x8BD1;&amp;#x8005;&amp;#x6CE8;&amp;#xFF1A;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x4E2D;&amp;#x5FC3;&amp;#x7EBF;&amp;#x6BD4;&amp;#x57FA;&amp;#x7EBF;&amp;#x9AD8;&amp;#x4E00;&amp;#x70B9;&amp;#xFF09;&amp;#xFF1B;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;sub&lt;/strong&gt;&amp;#xFF1A;&amp;#x5C06;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x57FA;&amp;#x7EBF;&amp;#x4E0E;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x4E0B;&amp;#x6807;&amp;#x57FA;&amp;#x7EBF;&amp;#x5BF9;&amp;#x9F50;&amp;#xFF1B;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;super&lt;/strong&gt;&amp;#xFF1A;&amp;#x5C06;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x57FA;&amp;#x7EBF;&amp;#x4E0E;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x4E0A;&amp;#x6807;&amp;#x57FA;&amp;#x7EBF;&amp;#x5BF9;&amp;#x9F50;&amp;#xFF1B;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;text-bottom&lt;/strong&gt;&amp;#xFF1A;&amp;#x5C06;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x5E95;&amp;#x90E8;&amp;#x4E0E;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x5B57;&amp;#x4F53;&amp;#x7684;&amp;#x6700;&amp;#x5E95;&amp;#x90E8;&amp;#x5BF9;&amp;#x9F50;&amp;#xFF08;&amp;#x8BD1;&amp;#x8005;&amp;#x6CE8;&amp;#xFF1A;&amp;#x5373;&amp;#x4E0E;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x6587;&amp;#x672C;&amp;#x5185;&amp;#x5BB9;&amp;#x533A;&amp;#x7684;&amp;#x6700;&amp;#x5E95;&amp;#x90E8;&amp;#x5BF9;&amp;#x9F50;&amp;#xFF09;&amp;#xFF1B;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;text-top&lt;/strong&gt;&amp;#xFF1A;&amp;#x5C06;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x9876;&amp;#x90E8;&amp;#x4E0E;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x5B57;&amp;#x4F53;&amp;#x7684;&amp;#x6700;&amp;#x9876;&amp;#x90E8;&amp;#x5BF9;&amp;#x9F50;&amp;#xFF08;&amp;#x8BD1;&amp;#x8005;&amp;#x6CE8;&amp;#xFF1A;&amp;#x5373;&amp;#x4E0E;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x6587;&amp;#x672C;&amp;#x5185;&amp;#x5BB9;&amp;#x533A;&amp;#x7684;&amp;#x6700;&amp;#x9876;&amp;#x90E8;&amp;#x5BF9;&amp;#x9F50;&amp;#xFF09;&amp;#xFF1B;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;top&lt;/strong&gt;&amp;#xFF1A;&amp;#x5C06;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x9876;&amp;#x90E8;&amp;#x4E0E;&lt;strong&gt;&lt;em&gt;&amp;#x884C;&lt;/em&gt;&lt;/strong&gt; &amp;#x7684;&amp;#x9876;&amp;#x90E8;&amp;#x5BF9;&amp;#x9F50;&amp;#xFF1B;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;length&lt;/strong&gt;&amp;#xFF1A;&amp;#x5C06;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x6587;&amp;#x672C;&amp;#x7684;&amp;#x57FA;&amp;#x7EBF;&amp;#x503C;&amp;#x8BBE;&amp;#x4E3A;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x57FA;&amp;#x7EBF;&amp;#x503C;&amp;#x52A0;&amp;#x4E0A;&lt;strong&gt;&lt;em&gt;length&lt;/em&gt;&lt;/strong&gt;&amp;#x6240;&amp;#x7ED9;&amp;#x5B9A;&amp;#x7684;&amp;#x503C;&amp;#xFF1B;&lt;/p&gt;
&lt;p class=&quot;codepen&quot; data-height=&quot;268&quot; data-theme-id=&quot;8525&quot; data-slug-hash=&quot;neDlk&quot; data-default-tab=&quot;result&quot; data-user=&quot;edenagency&quot;&gt;See the Pen &lt;a href=&quot;http://codepen.io/edenagency/pen/neDlk/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;The vertical-align property&lt;/a&gt; by Eden Agency (&lt;a href=&quot;http://codepen.io/edenagency&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;@edenagency&lt;/a&gt;) on &lt;a href=&quot;http://codepen.io&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;CodePen&lt;/a&gt;.&lt;/p&gt;
&lt;script async=&quot;async&quot; src=&quot;//codepen.io/assets/embed/ei.js&quot;&gt;&lt;/script&gt;
&lt;p&gt;&amp;#x5F53;vertical-align&amp;#x88AB;&amp;#x8BEF;&amp;#x7528;&amp;#x65F6;&amp;#xFF0C;vertical-align: middle&amp;#x901A;&amp;#x5E38;&amp;#x662F;&amp;#x7F6A;&amp;#x9B41;&amp;#x7978;&amp;#x9996;&amp;#xFF0C;&amp;#x6700;&amp;#x5E38;&amp;#x89C1;&amp;#x7684;&amp;#x539F;&amp;#x56E0;&amp;#x662F;&amp;#x7528;&amp;#x5728;&amp;#x4E86;&amp;#x5757;&amp;#x7EA7;&amp;#x5143;&amp;#x7D20;&amp;#x4E0A;&amp;#x3002;&amp;#x8BB0;&amp;#x4F4F;&amp;#xFF0C;&amp;#x5B83;&amp;#x4EC5;&amp;#x5728;inline&amp;#x548C;inline-block&amp;#x5143;&amp;#x7D20;&amp;#x4E0A;&amp;#x6709;&amp;#x6548;&amp;#x3002;&amp;#x5982;&amp;#x679C;&amp;#x7528;&amp;#x5728;&amp;#x4E86;&amp;#x5757;&amp;#x7EA7;&amp;#x5143;&amp;#x7D20;&amp;#x4E0A;&amp;#xFF0C;&amp;#x6240;&amp;#x6709;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x90FD;&amp;#x4F1A;&amp;#x7EE7;&amp;#x627F;&amp;#x5B83;&amp;#x7684;&amp;#x503C;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;vertical-align&amp;#x4E5F;&amp;#x53EF;&amp;#x7528;&amp;#x4E8E;HTML&amp;#x8868;&amp;#x683C;&amp;#x7684;&amp;#x5355;&amp;#x5143;&amp;#x683C;&amp;#x3002;&amp;#x9002;&amp;#x7528;&amp;#x4E8E;&amp;#x5355;&amp;#x5143;&amp;#x683C;&amp;#x65F6;&amp;#x7684;&amp;#x503C;&amp;#xFF1A;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;top&lt;/strong&gt;&amp;#xFF1A;&amp;#x5C06;&amp;#x5355;&amp;#x5143;&amp;#x683C;&amp;#x7684;&amp;#x5185;&amp;#x5BB9;&amp;#x4E0E;&amp;#x5355;&amp;#x5143;&amp;#x683C;&amp;#x7684;&amp;#x9876;&amp;#x90E8;&amp;#x5BF9;&amp;#x9F50;&amp;#xFF1B;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;middle&lt;/strong&gt;&amp;#xFF1A;&amp;#x5C06;&amp;#x5355;&amp;#x5143;&amp;#x683C;&amp;#x7684;&amp;#x5185;&amp;#x5BB9;&amp;#x4E0E;&amp;#x5355;&amp;#x5143;&amp;#x683C;&amp;#x7684;&amp;#x4E2D;&amp;#x5FC3;&amp;#x5BF9;&amp;#x9F50;&amp;#xFF1B;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;bottom&lt;/strong&gt;&amp;#xFF1A;&amp;#x5C06;&amp;#x5355;&amp;#x5143;&amp;#x683C;&amp;#x7684;&amp;#x5185;&amp;#x5BB9;&amp;#x4E0E;&amp;#x5355;&amp;#x5143;&amp;#x683C;&amp;#x7684;&amp;#x5E95;&amp;#x90E8;&amp;#x5BF9;&amp;#x9F50;&amp;#xFF1B;&lt;/p&gt;
&lt;p&gt;&amp;#x73B0;&amp;#x5728;&amp;#x6E05;&amp;#x6670;&amp;#x4E86;&amp;#xFF0C;&amp;#x8BA9;&amp;#x6211;&amp;#x4EEC;&amp;#x6765;&amp;#x770B;&amp;#x770B;&amp;#x600E;&amp;#x4E48;&amp;#x89E3;&amp;#x51B3;&amp;#x5728;&amp;#x5757;&amp;#x7EA7;&amp;#x5143;&amp;#x7D20;&amp;#x4E0A;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x8BD1;&amp;#x8005;&amp;#x6CE8;&amp;#xFF1A;vertical-align&amp;#x5C5E;&amp;#x6027;&amp;#x7684;&amp;#x542B;&amp;#x4E49;&amp;#x548C;&amp;#x56FE;&amp;#x89E3;&amp;#x4E5F;&amp;#x53EF;&amp;#x53C2;&amp;#x8003;&lt;a href=&quot;http://bitsofco.de/the-vertical-align-property/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;#x8FD9;&amp;#x91CC;&lt;/a&gt;&lt;/p&gt;
&lt;h2 id=&quot;line-height&quot;&gt;Line height&lt;/h2&gt;
&lt;p&gt;&amp;#x8FD9;&amp;#x662F;&amp;#x9879;&amp;#x7B80;&amp;#x5355;&amp;#x7684;&amp;#x6280;&amp;#x672F;&amp;#xFF0C;&amp;#x4F60;&amp;#x53EA;&amp;#x60F3;&amp;#x4E2D;&amp;#x5FC3;&amp;#x5BF9;&amp;#x9F50;&amp;#x4E00;&amp;#x884C;&amp;#x6587;&amp;#x672C;&amp;#x65F6;&amp;#x6548;&amp;#x679C;&amp;#x5F88;&amp;#x597D;&amp;#x3002;&amp;#x4E5F;&amp;#x53EF;&amp;#x7528;&amp;#x4E8E;&amp;#x56FE;&amp;#x7247;&amp;#xFF0C;&amp;#x4E0D;&amp;#x8FC7;&amp;#x8FD9;&amp;#x662F;&amp;#x4E00;&amp;#x79CD;hack&amp;#xFF0C;&amp;#x5C3D;&amp;#x91CF;&amp;#x907F;&amp;#x514D;&amp;#x4F7F;&amp;#x7528;&amp;#x3002;&lt;/p&gt;
&lt;p class=&quot;codepen&quot; data-height=&quot;347&quot; data-theme-id=&quot;8525&quot; data-slug-hash=&quot;GiLdm&quot; data-default-tab=&quot;result&quot; data-user=&quot;edenagency&quot;&gt;See the Pen &lt;a href=&quot;http://codepen.io/edenagency/pen/GiLdm/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Vertical alignment using line height&lt;/a&gt; by Eden Agency (&lt;a href=&quot;http://codepen.io/edenagency&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;@edenagency&lt;/a&gt;) on &lt;a href=&quot;http://codepen.io&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;CodePen&lt;/a&gt;.&lt;/p&gt;
&lt;p&gt;&amp;#x8FD9;&amp;#x4E2A;&amp;#x4F8B;&amp;#x5B50;&amp;#x5305;&amp;#x542B;&amp;#x4E86;&amp;#x4E24;&amp;#x4E2A;&amp;#x5143;&amp;#x7D20;&amp;#xFF0C;&amp;#x4E00;&amp;#x4E2A;&amp;#x662F;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#xFF0C;&amp;#x4E00;&amp;#x4E2A;&amp;#x662F;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x3002;line height&amp;#x8BBE;&amp;#x7F6E;&amp;#x5728;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x4E0A;&amp;#xFF0C;&amp;#x53CD;&amp;#x8FC7;&amp;#x6765;&amp;#x5F3A;&amp;#x5236;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x8C03;&amp;#x6574;&amp;#x5230;&amp;#x4E0E;&amp;#x4E4B;&amp;#x76F8;&amp;#x540C;&amp;#x7684;&amp;#x9AD8;&amp;#x5EA6;&amp;#x3002;&amp;#x6CE8;&amp;#x610F;&amp;#xFF1A;&amp;#x4E3A;&amp;#x8BA9;&amp;#x8FD9;&amp;#x9879;&amp;#x6280;&amp;#x672F;&amp;#x51D1;&amp;#x6548;&amp;#xFF0C;line height&amp;#x7684;&amp;#x503C;&amp;#x5FC5;&amp;#x987B;&amp;#x5927;&amp;#x4E8E;&amp;#x5B57;&amp;#x4F53;&amp;#x5927;&amp;#x5C0F;&amp;#x6216;&amp;#x56FE;&amp;#x7247;&amp;#x7684;&amp;#x9AD8;&amp;#x5EA6;&amp;#x3002;&amp;#x4E3A;&amp;#x4E86;&amp;#x7528;&amp;#x5728;&amp;#x56FE;&amp;#x7247;&amp;#x4E0A;&amp;#xFF0C;&amp;#x5FC5;&amp;#x987B;&amp;#x628A;vertical-align: middle&amp;#x6DFB;&amp;#x52A0;&amp;#x5230;&amp;#x56FE;&amp;#x7247;&amp;#x5143;&amp;#x7D20;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x5982;&amp;#x6211;&amp;#x4E4B;&amp;#x524D;&amp;#x6240;&amp;#x8BF4;&amp;#xFF0C;&amp;#x8FD9;&amp;#x662F;&amp;#x4E00;&amp;#x79CD;hack&amp;#xFF0C;&amp;#x7A0D;&amp;#x540E;&amp;#x63D0;&amp;#x53CA;&amp;#x80FD;&amp;#x4EA7;&amp;#x751F;&amp;#x540C;&amp;#x6837;&amp;#x6548;&amp;#x679C;&amp;#x7684;&amp;#x65B9;&amp;#x6CD5;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x4F18;&amp;#x70B9;&amp;#xFF1A;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x5BB9;&amp;#x6613;&amp;#x5B9E;&amp;#x73B0;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x7F3A;&amp;#x70B9;&amp;#xFF1A;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x53EA;&amp;#x80FD;&amp;#x7528;&amp;#x4E8E;&amp;#x4E00;&amp;#x884C;&amp;#x6587;&amp;#x672C;&amp;#xFF0C;&amp;#x5F53;&amp;#x7528;&amp;#x4E8E;&amp;#x6587;&amp;#x672C;&amp;#x4E4B;&amp;#x5916;&amp;#x65F6;&amp;#xFF0C;&amp;#x5B83;&amp;#x4E0D;&amp;#x591F;&amp;#x6B63;&amp;#x89C4;&amp;#x3001;&amp;#x4E0D;&amp;#x591F;&amp;#x4F18;&amp;#x96C5;&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;css&amp;#x8868;&amp;#x683C;&quot;&gt;CSS&amp;#x8868;&amp;#x683C;&lt;/h2&gt;
&lt;p&gt;&amp;#x662F;CSS&amp;#x7684;&amp;#x8868;&amp;#x683C;&amp;#x4E0D;&amp;#x662F;HTML&amp;#x7684;&amp;#x8868;&amp;#x683C;&amp;#x3002;&amp;#x6211;&amp;#x4EEC;&amp;#x53EF;&amp;#x4EE5;&amp;#x4F7F;&amp;#x7528;display: table&amp;#x8BA9;&amp;#x4E00;&amp;#x4E2A;&amp;#x5143;&amp;#x7D20;&amp;#x8868;&amp;#x73B0;&amp;#x5F97;&amp;#x50CF;&amp;#x4E2A;&amp;#x8868;&amp;#x683C;&amp;#x3002;&amp;#x8FD9;&amp;#x4E9B;&amp;#x8868;&amp;#x683C;&amp;#x5C5E;&amp;#x6027;&amp;#x57FA;&amp;#x4E8E;&amp;#x539F;&amp;#x6765;&amp;#x7684;HTML&amp;#x8868;&amp;#x683C;&amp;#x5143;&amp;#x7D20;&amp;#xFF0C;&amp;#x4E14;&amp;#x884C;&amp;#x4E3A;&amp;#x4E00;&amp;#x81F4;&amp;#x3002;&lt;/p&gt;
&lt;p class=&quot;codepen&quot; data-height=&quot;268&quot; data-theme-id=&quot;8525&quot; data-slug-hash=&quot;iwBua&quot; data-default-tab=&quot;result&quot; data-user=&quot;edenagency&quot;&gt;See the Pen &lt;a href=&quot;http://codepen.io/edenagency/pen/iwBua/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Vertical alignment using css table properties&lt;/a&gt; by Eden Agency (&lt;a href=&quot;http://codepen.io/edenagency&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;@edenagency&lt;/a&gt;) on &lt;a href=&quot;http://codepen.io&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;CodePen&lt;/a&gt;.&lt;/p&gt;
&lt;p&gt;&amp;#x5728;&amp;#x8FD9;&amp;#x4E2A;&amp;#x793A;&amp;#x4F8B;&amp;#x4E2D;&amp;#xFF0C;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x5F53;&amp;#x4F5C;&amp;#x8868;&amp;#x683C;&amp;#xFF0C;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x4F5C;&amp;#x4E3A;&amp;#x8868;&amp;#x683C;&amp;#x7684;&amp;#x5355;&amp;#x5143;&amp;#x683C;&amp;#x3002;vertical-align: middle&amp;#x4F7F;&amp;#x5355;&amp;#x5143;&amp;#x683C;&amp;#x5B8C;&amp;#x7F8E;&amp;#x5C45;&amp;#x4E2D;&amp;#xFF0C;&amp;#x6240;&amp;#x6709;&amp;#x7684;&amp;#x5355;&amp;#x5143;&amp;#x683C;&amp;#x7EE7;&amp;#x627F;&amp;#x4E86;&amp;#x5176;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x9AD8;&amp;#x5EA6;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x4F18;&amp;#x70B9;&amp;#xFF1A;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x5B8C;&amp;#x5168;&amp;#x50CF;HTML&amp;#x8868;&amp;#x683C;&amp;#x4E00;&amp;#x6837;&amp;#x8FD0;&amp;#x4F5C;&amp;#xFF0C;&amp;#x5E76;&amp;#x4E14;&amp;#x8BED;&amp;#x4E49;&amp;#x4E0A;&amp;#x6B63;&amp;#x786E;&amp;#xFF1B;
&amp;#x4E0D;&amp;#x9700;&amp;#x8981;&amp;#x5B9A;&amp;#x4E49;&amp;#x9AD8;&amp;#x5EA6;&amp;#x548C;&amp;#x5BBD;&amp;#x5EA6;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x7F3A;&amp;#x70B9;&amp;#xFF1A;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x9664;&amp;#x975E;&amp;#x5B9A;&amp;#x4E49;&amp;#x4E86;&amp;#x5BBD;&amp;#x5EA6;&amp;#xFF0C;&amp;#x8868;&amp;#x683C;&amp;#x4F1A;&amp;#x5C55;&amp;#x5F00;&amp;#x5230;&amp;#x5176;&amp;#x5185;&amp;#x5BB9;&amp;#x7684;&amp;#x5BBD;&amp;#x5EA6;&amp;#xFF1B;&lt;/p&gt;
&lt;p&gt;&amp;#x5982;&amp;#x679C;&amp;#x4F60;&amp;#x5728;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x4E2D;&amp;#x9700;&amp;#x8981;&amp;#x53E6;&amp;#x4E00;&amp;#x4E2A;&amp;#x5757;&amp;#x7EA7;&amp;#x5143;&amp;#x7D20;&amp;#x5E76;&amp;#x4E14;&amp;#x4E0D;&amp;#x60F3;&amp;#x628A;&amp;#x5B83;&amp;#x5F53;&amp;#x6210;table cell&amp;#xFF0C;&amp;#x4E8B;&amp;#x60C5;&amp;#x5C31;&amp;#x53D8;&amp;#x5F97;&amp;#x6DF7;&amp;#x4E71;&amp;#xFF1B;&lt;/p&gt;
&lt;p&gt;&amp;#x4E5F;&amp;#x53EF;&amp;#x4EE5;&amp;#x4F7F;&amp;#x7528;HTML&amp;#x8868;&amp;#x683C;&amp;#x6765;&amp;#x5B9E;&amp;#x73B0;&amp;#xFF0C;&amp;#x7136;&amp;#x800C;&amp;#x5E94;&amp;#x8BE5;&amp;#x907F;&amp;#x514D;&amp;#x4F7F;&amp;#x7528;HTML&amp;#x5143;&amp;#x7D20;&amp;#x53BB;&amp;#x8BBE;&amp;#x8BA1;&amp;#x9875;&amp;#x9762;&amp;#x7684;&amp;#x6837;&amp;#x5F0F;&amp;#xFF0C;&amp;#x90A3;&amp;#x662F;CSS&amp;#x7684;&amp;#x4E8B;&amp;#x60C5;&amp;#xFF0C;&amp;#x8BED;&amp;#x4E49;&amp;#x4E0A;&amp;#x4E5F;&amp;#x662F;&amp;#x9519;&amp;#x8BEF;&amp;#x7684;&amp;#xFF0C;&amp;#x9664;&amp;#x975E;&amp;#x4F60;&amp;#x7684;&amp;#x5185;&amp;#x5BB9;&amp;#x9002;&amp;#x7528;&amp;#x4E8E;&amp;#x8868;&amp;#x683C;&amp;#xFF0C;&amp;#x6BD4;&amp;#x5982;&amp;#x5217;&amp;#x8F66;&amp;#x65F6;&amp;#x523B;&amp;#x8868;&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x7EDD;&amp;#x5BF9;&amp;#x5B9A;&amp;#x4F4D;&quot;&gt;&amp;#x7EDD;&amp;#x5BF9;&amp;#x5B9A;&amp;#x4F4D;&lt;/h2&gt;
&lt;p&gt;&amp;#x4E3A;&amp;#x4E86;&amp;#x4F7F;&amp;#x7528;position: absolute&amp;#x6765;&amp;#x5782;&amp;#x76F4;&amp;#x5BF9;&amp;#x9F50;&amp;#x4F60;&amp;#x9009;&amp;#x62E9;&amp;#x7684;&amp;#x5143;&amp;#x7D20;&amp;#xFF0C;&amp;#x9700;&amp;#x8981;&amp;#x4F7F;&amp;#x7528;&amp;#x50CF;&amp;#x7D20;&amp;#x6216;&amp;#x767E;&amp;#x5206;&amp;#x6BD4;&amp;#x5B9A;&amp;#x4E49;&amp;#x4E00;&amp;#x4E2A;&amp;#x9AD8;&amp;#x5EA6;&amp;#x3002;&lt;/p&gt;
&lt;p class=&quot;codepen&quot; data-height=&quot;344&quot; data-theme-id=&quot;8525&quot; data-slug-hash=&quot;GuqjD&quot; data-default-tab=&quot;result&quot; data-user=&quot;edenagency&quot;&gt;See the Pen &lt;a href=&quot;http://codepen.io/edenagency/pen/GuqjD/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Vertical alignment using absolute positioning&lt;/a&gt; by Eden Agency (&lt;a href=&quot;http://codepen.io/edenagency&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;@edenagency&lt;/a&gt;) on &lt;a href=&quot;http://codepen.io&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;CodePen&lt;/a&gt;.&lt;/p&gt;
&lt;p&gt;&amp;#x6709;&amp;#x4E24;&amp;#x79CD;&amp;#x65B9;&amp;#x6CD5;&amp;#x53EF;&amp;#x5C45;&amp;#x4E2D;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x3002;&amp;#x7B2C;&amp;#x4E00;&amp;#x79CD;&amp;#x9009;&amp;#x62E9;&amp;#xFF0C;&amp;#x5982;&amp;#x4E0A;&amp;#x56FE;&amp;#x6240;&amp;#x793A;&amp;#xFF0C;&amp;#x7528;top: 50%&amp;#x4E0B;&amp;#x79FB;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#xFF0C;&amp;#x7528;transform: translateY(-50%)&amp;#x4E0A;&amp;#x79FB;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x9AD8;&amp;#x5EA6;&amp;#x7684;&amp;#x4E00;&amp;#x534A;&amp;#xFF0C;&amp;#x4EE5;&amp;#x81F4;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x4E2D;&amp;#x5FC3;&amp;#x4E0E;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x4F4D;&amp;#x4E8E;&amp;#x540C;&amp;#x4E00;&amp;#x884C;&amp;#x3002;&amp;#x4E5F;&amp;#x53EF;&amp;#x4EE5;&amp;#x4F7F;&amp;#x7528;&amp;#x8D1F;&amp;#x503C;&amp;#x7684;&amp;#x5916;&amp;#x8FB9;&amp;#x8DDD;&amp;#xFF08;margin&amp;#xFF09;&amp;#x5B9E;&amp;#x73B0;&amp;#xFF1B;&amp;#x7B2C;&amp;#x4E8C;&amp;#x79CD;&amp;#x9009;&amp;#x62E9;&amp;#x662F;&amp;#x628A;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x7684;top, bottom, left, right&amp;#x5C5E;&amp;#x6027;&amp;#x7684;&amp;#x503C;&amp;#x5747;&amp;#x8BBE;&amp;#x4E3A;0&amp;#xFF0C;&amp;#x5916;&amp;#x8FB9;&amp;#x8DDD;&amp;#x5747;&amp;#x8BBE;&amp;#x6210;auto&amp;#xFF0C;&amp;#x7136;&amp;#x800C;&amp;#x7528;&amp;#x8FD9;&amp;#x79CD;&amp;#x65B9;&amp;#x6CD5;&amp;#x6211;&amp;#x5F97;&amp;#x5230;&amp;#x8FC7;&amp;#x4E0D;&amp;#x540C;&amp;#x7684;&amp;#x7ED3;&amp;#x679C;&amp;#xFF0C;&amp;#x6700;&amp;#x597D;&amp;#x8FD8;&amp;#x662F;&amp;#x9009;&amp;#x62E9;&amp;#x7B2C;&amp;#x4E00;&amp;#x79CD;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x4F18;&amp;#x70B9;&amp;#xFF1A;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x5C3A;&amp;#x5BF8;&amp;#x4F7F;&amp;#x7528;&amp;#x767E;&amp;#x5206;&amp;#x6BD4;&amp;#x80FD;&amp;#x4F7F;&amp;#x5143;&amp;#x7D20;&amp;#x81EA;&amp;#x9002;&amp;#x5E94;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x7F3A;&amp;#x70B9;&amp;#xFF1A;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x9700;&amp;#x8981;&amp;#x5B9A;&amp;#x4E49;&amp;#x4E00;&amp;#x4E2A;&amp;#x9AD8;&amp;#x5EA6;&amp;#xFF0C;&amp;#x6709;&amp;#x65F6;&amp;#x8FD9;&amp;#x662F;&amp;#x4E0D;&amp;#x53EF;&amp;#x80FD;&amp;#x7684;&amp;#xFF1B;&lt;/p&gt;
&lt;p&gt;&amp;#x5982;&amp;#x679C;&amp;#x4E0D;&amp;#x6B62;&amp;#x4E00;&amp;#x4E2A;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#xFF0C;&amp;#x53EF;&amp;#x80FD;&amp;#x6709;&amp;#x91CD;&amp;#x53E0;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x9664;&amp;#x975E;&amp;#x5B83;&amp;#x4EEC;&amp;#x4E5F;&amp;#x662F;&amp;#x7EDD;&amp;#x5BF9;&amp;#x5B9A;&amp;#x4F4D;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x4F60;&amp;#x5FC5;&amp;#x987B;&amp;#x8BB0;&amp;#x5F97;&amp;#x76F8;&amp;#x5BF9;&amp;#x5730;&amp;#x6216;&amp;#x7EDD;&amp;#x5BF9;&amp;#x5730;&amp;#x5B9A;&amp;#x4F4D;&amp;#x4F60;&amp;#x7684;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#xFF0C;&amp;#x5426;&amp;#x5219;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x4E0D;&amp;#x4F1A;&amp;#x5C45;&amp;#x4E2D;&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x5E7D;&amp;#x7075;&amp;#x5143;&amp;#x7D20;&quot;&gt;&amp;#x5E7D;&amp;#x7075;&amp;#x5143;&amp;#x7D20;&lt;/h2&gt;
&lt;p&gt;&amp;#x8FD9;&amp;#x9879;&amp;#x6280;&amp;#x672F;&amp;#x6700;&amp;#x521D;&amp;#x5728;CSS Tricks&amp;#x7684;&amp;#x535A;&amp;#x5BA2;&amp;#x6587;&amp;#x7AE0;&lt;a href=&quot;http://css-tricks.com/centering-in-the-unknown/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;quot;Centering in the Unknown&amp;quot;&lt;/a&gt;&amp;#x4E2D;&amp;#x63D0;&amp;#x53CA;&amp;#x3002;&amp;#x4E00;&amp;#x4E2A;&amp;#x5E7D;&amp;#x7075;&amp;#x5143;&amp;#x7D20;&amp;#x7528;&amp;#x4E8E;&amp;#x5728;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x4E2D;&amp;#x5C45;&amp;#x4E2D;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x3002;&amp;#x56E0;&amp;#x4E3A;&amp;#x5E7D;&amp;#x7075;&amp;#x5143;&amp;#x7D20;&amp;#x88AB;&amp;#x8D4B;&amp;#x4E8E;&amp;#x4E86;&amp;#x4E00;&amp;#x4E2A;100%&amp;#x7684;&amp;#x9AD8;&amp;#x5EA6;&amp;#xFF0C;&amp;#x6CA1;&amp;#x6709;&amp;#x5FC5;&amp;#x8981;&amp;#x4E3A;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x6216;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x5B9A;&amp;#x4E49;&amp;#x9AD8;&amp;#x5EA6;&amp;#x3002;&amp;#x5F53;&amp;#x65E0;&amp;#x6CD5;&amp;#x77E5;&amp;#x9053;&amp;#x5C3A;&amp;#x5BF8;&amp;#x65F6;&amp;#xFF0C;&amp;#x8FD9;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x7406;&amp;#x60F3;&amp;#x7684;&amp;#x65B9;&amp;#x6CD5;&amp;#x3002;&lt;/p&gt;
&lt;p class=&quot;codepen&quot; data-height=&quot;295&quot; data-theme-id=&quot;8525&quot; data-slug-hash=&quot;trKAu&quot; data-default-tab=&quot;result&quot; data-user=&quot;edenagency&quot;&gt;See the Pen &lt;a href=&quot;http://codepen.io/edenagency/pen/trKAu/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Vertical alignment using the &amp;apos;Ghost Element&amp;apos;&lt;/a&gt; by Eden Agency (&lt;a href=&quot;http://codepen.io/edenagency&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;@edenagency&lt;/a&gt;) on &lt;a href=&quot;http://codepen.io&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;CodePen&lt;/a&gt;.&lt;/p&gt;
&lt;p&gt;&amp;#x5982;&amp;#x540C;Chris Coyier&amp;#x5728;&amp;#x4ED6;&amp;#x7684;&amp;#x535A;&amp;#x5BA2;&amp;#x4E2D;&amp;#x63D0;&amp;#x53CA;&amp;#x7684;&amp;#xFF0C;Michal Czernow&amp;#x5EFA;&amp;#x8BAE;&amp;#x4F7F;&amp;#x7528;&amp;#x4E00;&amp;#x4E2A;&amp;#x4F2A;&amp;#x5143;&amp;#x7D20;&amp;#x4F5C;&amp;#x4E3A;&amp;#x5E7D;&amp;#x7075;&amp;#x5143;&amp;#x7D20;&amp;#xFF0C;&amp;#x4E0D;&amp;#x7528;&amp;#x53E6;&amp;#x52A0;&amp;#x4E00;&amp;#x4E2A;div&amp;#x4E14;&amp;#x8BED;&amp;#x4E49;&amp;#x4E0A;&amp;#x662F;&amp;#x6B63;&amp;#x786E;&amp;#x7684;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x4F18;&amp;#x70B9;&amp;#xFF1A;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x8BED;&amp;#x4E49;&amp;#x6B63;&amp;#x786E;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x7F3A;&amp;#x70B9;&amp;#xFF1A;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x5B8C;&amp;#x5168;&amp;#x50CF;CSS&amp;#x8868;&amp;#x683C;&amp;#x4E00;&amp;#x6837;&amp;#x8FD0;&amp;#x4F5C;&amp;#xFF0C;&amp;#x4E24;&amp;#x9879;&amp;#x6280;&amp;#x672F;&amp;#x90FD;&amp;#x4E0D;&amp;#x6BD4;&amp;#x53E6;&amp;#x4E00;&amp;#x4E2A;&amp;#x66F4;&amp;#x597D;&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;flexbox&quot;&gt;Flexbox&lt;/h2&gt;
&lt;p&gt;&amp;#x5728;CSS&amp;#x5BB6;&amp;#x65CF;&amp;#x4E2D;Flexbox&amp;#xFF08;CSS3 &amp;#x5F39;&amp;#x6027;&amp;#x76D2;&amp;#x6A21;&amp;#x578B;&amp;#xFF09;&amp;#x662F;&amp;#x9879;&amp;#x76F8;&amp;#x5BF9;&amp;#x8F83;&amp;#x65B0;&amp;#x7684;&amp;#x6280;&amp;#x672F;&amp;#x3002;&amp;#x6211;&amp;#x4E0D;&amp;#x60F3;&amp;#x6DF1;&amp;#x5165;&amp;#x592A;&amp;#x591A;&amp;#x7EC6;&amp;#x8282;&amp;#xFF0C;&amp;#x6709;&amp;#x5F88;&amp;#x591A;&amp;#x7EC6;&amp;#x8282;&amp;#xFF0C;&amp;#x6240;&amp;#x4EE5;&amp;#x8FD9;&amp;#x91CC;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x5BF9;&amp;#x5B83;&amp;#x662F;&amp;#x505A;&amp;#x4EC0;&amp;#x4E48;&amp;#x7684;&amp;#x5FEB;&amp;#x901F;&amp;#x63CF;&amp;#x8FF0;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x6839;&amp;#x636E;&lt;a href=&quot;http://www.w3.org/TR/2014/WD-css-flexbox-1-20140325/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;www.w3.org&lt;/a&gt;:&lt;/p&gt;
&lt;p&gt;&amp;#x201C;&amp;#x5728;flex&amp;#x5E03;&amp;#x5C40;&amp;#x6A21;&amp;#x578B;&amp;#x4E2D;&amp;#xFF0C;flex&amp;#x5BB9;&amp;#x5668;&amp;#x7684;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x53EF;&amp;#x4EE5;&amp;#x5728;&amp;#x4EFB;&amp;#x4E00;&amp;#x65B9;&amp;#x5411;&amp;#x5C55;&amp;#x5F00;&amp;#xFF0C;&amp;#x5E76;&amp;#x4E14;&amp;#x5B83;&amp;#x4EEC;&amp;#x7684;&amp;#x5927;&amp;#x5C0F;&amp;#x5177;&amp;#x6709;&amp;#x76F8;&amp;#x5F53;&amp;#x7684;&amp;#x5F39;&amp;#x6027;&amp;#xFF0C;&amp;#x5373;&amp;#x80FD;&amp;#x589E;&amp;#x957F;&amp;#x4EE5;&amp;#x586B;&amp;#x5145;&amp;#x672A;&amp;#x4F7F;&amp;#x7528;&amp;#x7684;&amp;#x7A7A;&amp;#x95F4;&amp;#xFF0C;&amp;#x4E5F;&amp;#x53EF;&amp;#x4EE5;&amp;#x7F29;&amp;#x5C0F;&amp;#x4EE5;&amp;#x9632;&amp;#x6B62;&amp;#x6EA2;&amp;#x51FA;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x3002;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x5728;&amp;#x6C34;&amp;#x5E73;&amp;#x548C;&amp;#x5782;&amp;#x76F4;&amp;#x4E24;&amp;#x4E2A;&amp;#x65B9;&amp;#x5411;&amp;#x7684;&amp;#x5BF9;&amp;#x9F50;&amp;#x5747;&amp;#x5BB9;&amp;#x6613;&amp;#x64CD;&amp;#x63A7;&amp;#x3002;&amp;#x76D2;&amp;#x5B50;&amp;#x7684;&amp;#x5D4C;&amp;#x5957;&amp;#xFF08;&amp;#x6C34;&amp;#x5E73;&amp;#x7684;&amp;#x5728;&amp;#x5782;&amp;#x76F4;&amp;#x7684;&amp;#x4E2D;&amp;#xFF0C;&amp;#x6216;&amp;#x8005;&amp;#x5782;&amp;#x76F4;&amp;#x7684;&amp;#x5728;&amp;#x6C34;&amp;#x5E73;&amp;#x7684;&amp;#x4E2D;&amp;#xFF09;&amp;#x53EF;&amp;#x4EE5;&amp;#x5728;&amp;#x4E24;&amp;#x4E2A;&amp;#x7EF4;&amp;#x5EA6;&amp;#x4E0A;&amp;#x6784;&amp;#x5EFA;&amp;#x5E03;&amp;#x5C40;&amp;#x3002;&amp;#x201C;&lt;/p&gt;
&lt;p&gt;&amp;#x603B;&amp;#x7684;&amp;#x6765;&amp;#x8BF4;&amp;#xFF0C;Flexbox&amp;#x4EC5;&amp;#x9002;&amp;#x7528;&amp;#x4E8E;&amp;#x5C0F;&amp;#x578B;&amp;#x7684;&amp;#x53EF;&amp;#x4F38;&amp;#x7F29;&amp;#x5E03;&amp;#x5C40;&amp;#x3002;&amp;#x5B83;&amp;#x5F88;&amp;#x5BB9;&amp;#x6613;&amp;#x5747;&amp;#x7B49;&amp;#x5730;&amp;#xFF08;&amp;#x6216;&amp;#x4E0D;&amp;#x5747;&amp;#x5300;&amp;#x5730;&amp;#xFF09;&amp;#x628A;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x5206;&amp;#x6210;&amp;#x591A;&amp;#x884C;&amp;#x6216;&amp;#x591A;&amp;#x5217;&amp;#xFF0C;&amp;#x6539;&amp;#x53D8;&amp;#x5143;&amp;#x7D20;&amp;#x6D41;&amp;#x52A8;&amp;#x7684;&amp;#x65B9;&amp;#x5411;&amp;#x7B49;&amp;#x7B49;&amp;#x3002;&amp;#x5728;&amp;#x4E00;&amp;#x4E2A;&amp;#x5BB9;&amp;#x5668;&amp;#x4E2D;&amp;#x5782;&amp;#x76F4;&amp;#x5BF9;&amp;#x9F50;&amp;#x4E00;&amp;#x4E2A;&amp;#x5355;&amp;#x4E00;&amp;#x5143;&amp;#x7D20;&amp;#x5341;&amp;#x5206;&amp;#x5730;&amp;#x7B80;&amp;#x5355;&amp;#x3002;&lt;/p&gt;
&lt;p class=&quot;codepen&quot; data-height=&quot;268&quot; data-theme-id=&quot;8525&quot; data-slug-hash=&quot;DKCwz&quot; data-default-tab=&quot;result&quot; data-user=&quot;edenagency&quot;&gt;See the Pen &lt;a href=&quot;http://codepen.io/edenagency/pen/DKCwz/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Vertical alignment using flexbox&lt;/a&gt; by Eden Agency (&lt;a href=&quot;http://codepen.io/edenagency&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;@edenagency&lt;/a&gt;) on &lt;a href=&quot;http://codepen.io&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;CodePen&lt;/a&gt;.&amp;#xA0;&lt;/p&gt;
&lt;p&gt;&amp;#x5F53;&amp;#x4E00;&amp;#x4E2A;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x4ECE;&amp;#x5757;&amp;#x7EA7;&amp;#x5143;&amp;#x7D20;&amp;#x8F6C;&amp;#x53D8;&amp;#x6210;&amp;#x4E00;&amp;#x4E2A;flex&amp;#x5143;&amp;#x7D20;&amp;#xFF0C;&amp;#x5B83;&amp;#x7684;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x4E5F;&amp;#x81EA;&amp;#x52A8;&amp;#x8F6C;&amp;#x53D8;&amp;#x6210;flex&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x3002;&amp;#x8BBE;&amp;#x7F6E;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x7684;margin&amp;#x5C5E;&amp;#x6027;&amp;#x4E3A;auto&amp;#x5C06;&amp;#x628A;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x63A8;&amp;#x5411;&amp;#x5176;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x7684;&amp;#x4E2D;&amp;#x5FC3;&amp;#xFF0C;&amp;#x6DFB;&amp;#x52A0;&amp;#x66F4;&amp;#x591A;&amp;#x7684;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x4E0D;&amp;#x4F1A;&amp;#x5F71;&amp;#x54CD;&amp;#x5B83;&amp;#x7684;&amp;#x5782;&amp;#x76F4;&amp;#x5C45;&amp;#x4E2D;&amp;#xFF0C;&amp;#x867D;&amp;#x7136;&amp;#x5B83;&amp;#x4F1A;&amp;#x76F8;&amp;#x5BF9;&amp;#x4E8E;&amp;#x5B83;&amp;#x7684;&amp;#x5144;&amp;#x5F1F;&amp;#x5143;&amp;#x7D20;&amp;#x91CD;&amp;#x65B0;&amp;#x6392;&amp;#x5217;&amp;#x3002;&amp;#x4F8B;&amp;#x5982;&amp;#xFF0C;&amp;#x5982;&amp;#x679C;&amp;#x6709;&amp;#x592A;&amp;#x591A;&amp;#x7684;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x9700;&amp;#x8981;&amp;#x56FA;&amp;#x5B9A;&amp;#x5728;&amp;#x540C;&amp;#x4E00;&amp;#x884C;&amp;#x4E0A;&amp;#xFF0C;&amp;#x5E76;&amp;#x4E14;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x6709;flex-wrap: wrap&amp;#x5C5E;&amp;#x6027;&amp;#xFF0C;&amp;#x591A;&amp;#x4F59;&amp;#x7684;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x4F1A;&amp;#x6389;&amp;#x5230;&amp;#x4E0B;&amp;#x4E00;&amp;#x884C;&amp;#xFF0C;&amp;#x6240;&amp;#x6709;&amp;#x7684;&amp;#x5B50;&amp;#x5143;&amp;#x7D20;&amp;#x5747;&amp;#x5728;&amp;#x5B83;&amp;#x4EEC;&amp;#x7684;&amp;#x7236;&amp;#x5143;&amp;#x7D20;&amp;#x4E2D;&amp;#x5C45;&amp;#x4E2D;&amp;#x5C31;&amp;#x50CF;&amp;#x5B83;&amp;#x4EEC;&amp;#x662F;&amp;#x4E00;&amp;#x4E2A;&amp;#x6574;&amp;#x4F53;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x4F18;&amp;#x70B9;&amp;#xFF1A;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;Flexbox&amp;#x5C31;&amp;#x662F;&amp;#x7528;&amp;#x6765;&amp;#x89E3;&amp;#x51B3;&amp;#x5E03;&amp;#x5C40;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x56E0;&amp;#x800C;&amp;#x5BF9;&amp;#x4E8E;&amp;#x5782;&amp;#x76F4;&amp;#x5BF9;&amp;#x9F50;&amp;#x5B83;&amp;#x662F;&amp;#x7406;&amp;#x60F3;&amp;#x7684;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&lt;strong&gt;&amp;#x7F3A;&amp;#x70B9;&amp;#xFF1A;&lt;/strong&gt;&lt;/p&gt;
&lt;p&gt;&amp;#x901A;&amp;#x8FC7;&amp;#x4F7F;&amp;#x7528;&amp;#x524D;&amp;#x7F00;&amp;#xFF0C;&amp;#x5B83;&amp;#x867D;&amp;#x7136;&amp;#x548C;&amp;#x6240;&amp;#x6709;&amp;#x6700;&amp;#x65B0;&amp;#x7684;&amp;#x6D4F;&amp;#x89C8;&amp;#x5668;&amp;#x517C;&amp;#x5BB9;&amp;#xFF0C;&amp;#x4F46;&amp;#x4E0D;&amp;#x652F;&amp;#x6301;&amp;#x65E7;&amp;#x7248;&amp;#x672C;&amp;#x7684;&amp;#x6D4F;&amp;#x89C8;&amp;#x5668;&amp;#xFF0C;&amp;#x5982;&amp;#xFF1A;IE9&amp;#x3002;
&amp;#x5982;&amp;#x679C;&amp;#x4F60;&amp;#x60F3;&amp;#x4E86;&amp;#x89E3;&amp;#x5173;&amp;#x4E8E;Flexbox&amp;#x7684;&amp;#x66F4;&amp;#x591A;&amp;#x4FE1;&amp;#x606F;&amp;#xFF0C;&amp;#x770B;&amp;#x4E0B;CSS Tricks&amp;#x7684;&lt;a href=&quot;http://css-tricks.com/snippets/css/a-guide-to-flexbox/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;&amp;quot;A Complete Guide to Flexbox&amp;quot;&lt;/a&gt;&amp;#x3002;&lt;/p&gt;
&lt;h2 id=&quot;&amp;#x603B;&amp;#x7ED3;&quot;&gt;&amp;#x603B;&amp;#x7ED3; &amp;#x3002;&amp;#x3002;&amp;#x3002;&lt;/h2&gt;
&lt;p&gt;&amp;#x6709;&amp;#x8FD9;&amp;#x4E48;&amp;#x591A;&amp;#x7684;&amp;#x9009;&amp;#x62E9;&amp;#xFF0C;&amp;#x771F;&amp;#x662F;&amp;#x5947;&amp;#x602A;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x6211;&amp;#x4EEC;&amp;#x53D1;&amp;#x73B0;&amp;#x5782;&amp;#x76F4;&amp;#x5BF9;&amp;#x9F50;&amp;#x8FD8;&amp;#x662F;&amp;#x8FD9;&amp;#x4E48;&amp;#x96BE;&amp;#xFF01;&amp;#x4E0D;&amp;#x5E78;&amp;#x7684;&amp;#x662F;&amp;#x6CA1;&amp;#x6709;&amp;#x4E00;&amp;#x4E2A;&amp;#x6700;&amp;#x4F73;&amp;#x89E3;&amp;#x51B3;&amp;#x65B9;&amp;#x6848;&amp;#x3002;Flexbox&amp;#x770B;&amp;#x4E0A;&amp;#x53BB;&amp;#x66F4;&amp;#x6709;&amp;#x524D;&amp;#x666F;&amp;#xFF0C;&amp;#x552F;&amp;#x4E00;&amp;#x7684;&amp;#x7F3A;&amp;#x70B9;&amp;#x662F;&amp;#x5B83;&amp;#x4E0E;&amp;#x65E7;&amp;#x7248;&amp;#x6D4F;&amp;#x89C8;&amp;#x5668;&amp;#x7684;&amp;#x517C;&amp;#x5BB9;&amp;#x6027;&amp;#xFF0C;&amp;#x7136;&amp;#x800C;&amp;#x6211;&amp;#x60F3;&amp;#x4E00;&amp;#x65E6;&amp;#x89C4;&amp;#x8303;&amp;#x6572;&amp;#x5B9A;&amp;#x5B83;&amp;#x4F1A;&amp;#x662F;&amp;#x6211;&amp;#x4EEC;&amp;#x8981;&amp;#x8F6C;&amp;#x5411;&amp;#x7684;&amp;#x6280;&amp;#x672F;&amp;#x3002;&lt;/p&gt;
&lt;p&gt;&amp;#x539F;&amp;#x6587;&amp;#xFF1A;&lt;a href=&quot;http://createdineden.com/blog/2014/september/24/a-professional-guide-how-to-vertically-align-elements-using-css/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;A Professional Guide: How to Vertically Align Elements Using CSS&lt;/a&gt;&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;p&gt;任何一个Web开发人员都会遇到垂直对齐这个老问题。我在Web领域工作了将近一年，已经被客户问了多次“把这个对齐到窗口中央”或“把那个放到那个的中部”。使用CSS容易实现水平对齐：&lt;/p&gt;
&lt;p&gt;对于块级元素（block-level element）&lt;/p&gt;
&lt;figure class=&quot;highlight scss&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;attribute&quot;&gt;display&lt;/span&gt;: block; &lt;span class=&quot;attribute&quot;&gt;margin&lt;/span&gt;: &lt;span class=&quot;number&quot;&gt;0&lt;/span&gt; auto;&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt;对于内联元素（inline element，也叫行内元素）&lt;/p&gt;
&lt;figure class=&quot;highlight scss&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;attribute&quot;&gt;display&lt;/span&gt;: inline-block; &lt;span class=&quot;attribute&quot;&gt;text-align&lt;/span&gt;: center;&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt;为什么垂直对齐不能这么简单？问题在于网站传统上并不是为了垂直对齐，网页是横向缩放的，高度改变以适应内容。我们幸运的是CSS有多种方法可以绕过这个问题，有些方法好于其他，有些则是十分糟糕，不应该使用。记住这些都是相对的（有时是绝对的），一个可以在某种情况下解决问题的方法可能不能解决另外一种情况的问题。&lt;/p&gt;
    
    </summary>
    
    
      <category term="translation" scheme="http://lnxpgn.github.io/tags/translation/"/>
    
      <category term="翻译" scheme="http://lnxpgn.github.io/tags/%E7%BF%BB%E8%AF%91/"/>
    
      <category term="CSS" scheme="http://lnxpgn.github.io/tags/CSS/"/>
    
      <category term="vertically align" scheme="http://lnxpgn.github.io/tags/vertically-align/"/>
    
      <category term="垂直对齐" scheme="http://lnxpgn.github.io/tags/%E5%9E%82%E7%9B%B4%E5%AF%B9%E9%BD%90/"/>
    
  </entry>
  
  <entry>
    <title>Hexo + Markdown issues</title>
    <link href="http://lnxpgn.github.io/2015/08/01/hexo-markdown-issues/"/>
    <id>http://lnxpgn.github.io/2015/08/01/hexo-markdown-issues/</id>
    <published>2015-08-01T08:19:03.000Z</published>
    <updated>2015-08-01T08:24:53.000Z</updated>
    
    <content type="html">&lt;h2 id=&quot;backslash-escapes&quot;&gt;Backslash escapes&lt;/h2&gt;
&lt;p&gt;Hexo installs a plugin &lt;em&gt;hexo-renderer-marked&lt;/em&gt; as the default Markdown renderer, but the plugin generates literal characters which are not what you want if have a backslash before these characters, such as &lt;em&gt;&amp;quot;scrapy crawl \&amp;lt;spider name\&amp;gt;&amp;quot;&lt;/em&gt; becomes &lt;em&gt;&amp;quot;scrapy crawl \&amp;quot;&lt;/em&gt;. To fix this issue by replacing &lt;em&gt;hexo-renderer-marked&lt;/em&gt; with &lt;em&gt;hexo-renderer-markdown-it&lt;/em&gt;.&lt;/p&gt;
&lt;h2 id=&quot;read-more-link&quot;&gt;&amp;quot;Read More&amp;quot; link&lt;/h2&gt;
&lt;p&gt;Normally, we insert &lt;em&gt;&amp;quot;&amp;lt;!-- more --&amp;gt;&amp;quot;&lt;/em&gt; into a post to display its summary, but don&amp;apos;t work if using &lt;em&gt;hexo-renderer-markdown-it&lt;/em&gt; with default configuration, &lt;em&gt;hexo-renderer-markdown-it&lt;/em&gt; escapes HTML. To fix this issue by appending&lt;/p&gt;
&lt;figure class=&quot;highlight yaml&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;2&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;3&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;attr&quot;&gt;markdown:&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;attr&quot;&gt;  render:&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;attr&quot;&gt;    html:&lt;/span&gt; &lt;span class=&quot;literal&quot;&gt;true&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt;to &lt;em&gt;Hexo&lt;/em&gt;&amp;apos;s &lt;em&gt;_config.yml&lt;/em&gt;.&lt;/p&gt;
</content>
    
    <summary type="html">
    
      &lt;h2 id=&quot;backslash-escapes&quot;&gt;Backslash escapes&lt;/h2&gt;
&lt;p&gt;Hexo installs a plugin &lt;em&gt;hexo-renderer-marked&lt;/em&gt; as the default Markdown renderer, 
    
    </summary>
    
    
      <category term="Hexo" scheme="http://lnxpgn.github.io/tags/Hexo/"/>
    
      <category term="Markdown" scheme="http://lnxpgn.github.io/tags/Markdown/"/>
    
  </entry>
  
  <entry>
    <title>Using multiple spiders in a Scrapy project</title>
    <link href="http://lnxpgn.github.io/2015/07/27/using-multiple-spiders-in-a-scrapy-project/"/>
    <id>http://lnxpgn.github.io/2015/07/27/using-multiple-spiders-in-a-scrapy-project/</id>
    <published>2015-07-27T12:18:21.000Z</published>
    <updated>2015-08-01T05:14:09.000Z</updated>
    
    <content type="html">&lt;h2 id=&quot;overview&quot;&gt;Overview&lt;/h2&gt;
&lt;p&gt;Different channel&amp;apos;s structure in a websit are similar, sometimes we want to reuse source code and don&amp;apos;t create a &lt;a href=&quot;http://scrapy.org/&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;Scrap&lt;/a&gt; project per channel. This is a tutorial how to use multiple spiders in a Scrapy project.&lt;/p&gt;
&lt;h2 id=&quot;env&quot;&gt;ENV&lt;/h2&gt;
&lt;p&gt;Python: 2.7.5&lt;br&gt;
Scrapy: 0.24.2&lt;/p&gt;
&lt;h2 id=&quot;tree-like-directories-of-this-tutorial-project&quot;&gt;Tree-like directories of this tutorial project&lt;/h2&gt;
&lt;p&gt;Source code in GitHub: &lt;a href=&quot;https://github.com/lnxpgn/scrapy_multiple_spiders&quot; target=&quot;_blank&quot; rel=&quot;external&quot;&gt;scrapy_multiple_spiders&lt;/a&gt;&lt;/p&gt;
&lt;figure class=&quot;highlight stylus&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;2&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;3&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;4&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;5&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;6&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;7&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;8&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;9&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;10&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;11&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;12&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;13&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;14&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;15&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;16&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;17&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;18&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;19&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;20&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;scrapy_multiple_spiders&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&amp;#x251C;&amp;#x2500;&amp;#x2500; commands&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&amp;#x2502;&amp;#xA0;&amp;#xA0; &amp;#x251C;&amp;#x2500;&amp;#x2500; __init__&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&amp;#x2502;&amp;#xA0;&amp;#xA0; &amp;#x2514;&amp;#x2500;&amp;#x2500; crawl&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&amp;#x2514;&amp;#x2500;&amp;#x2500; tutorial&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &amp;#x251C;&amp;#x2500;&amp;#x2500; scrapy&lt;span class=&quot;selector-class&quot;&gt;.cfg&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &amp;#x2514;&amp;#x2500;&amp;#x2500; tutorial&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &amp;#x251C;&amp;#x2500;&amp;#x2500; __init__&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &amp;#x251C;&amp;#x2500;&amp;#x2500; common_spider&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &amp;#x251C;&amp;#x2500;&amp;#x2500; items&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &amp;#x251C;&amp;#x2500;&amp;#x2500; pipelines&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &amp;#x251C;&amp;#x2500;&amp;#x2500; settings&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &amp;#x251C;&amp;#x2500;&amp;#x2500; spider_settings&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &amp;#x2502;&amp;#xA0;&amp;#xA0; &amp;#x251C;&amp;#x2500;&amp;#x2500; __init__&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &amp;#x2502;&amp;#xA0;&amp;#xA0; &amp;#x251C;&amp;#x2500;&amp;#x2500; spider1&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &amp;#x2502;&amp;#xA0;&amp;#xA0; &amp;#x2514;&amp;#x2500;&amp;#x2500; spider2&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &amp;#x2514;&amp;#x2500;&amp;#x2500; spiders&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            &amp;#x251C;&amp;#x2500;&amp;#x2500; __init__&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            &amp;#x251C;&amp;#x2500;&amp;#x2500; spider1&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            &amp;#x2514;&amp;#x2500;&amp;#x2500; spider2.py&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;a id=&quot;more&quot;&gt;&lt;/a&gt;
&lt;h2 id=&quot;custom-project-command&quot;&gt;Custom project command&lt;/h2&gt;
&lt;p&gt;In Scrapy we can add our custom project commands by using the COMMANDS_MODULE setting item in &lt;em&gt;settings.py&lt;/em&gt;, we will custom the standard &lt;em&gt;&amp;quot;crawl&amp;quot;&lt;/em&gt; command. When call &lt;em&gt;&amp;quot;scrapy crawl &amp;lt;spider name&amp;gt;&amp;quot;&lt;/em&gt;, the &lt;em&gt;run()&lt;/em&gt; function in &lt;em&gt;scrapy.commands.crawl.Command&lt;/em&gt; is the entrance. Inherit &lt;em&gt;scrapy.commands.crawl.Command&lt;/em&gt; and overwrite the &lt;em&gt;run()&lt;/em&gt; function in our project&amp;apos;s &lt;em&gt;commands.crawl.CustomCrawlCommand&lt;/em&gt; class.&lt;/p&gt;
&lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;2&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;3&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;4&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;5&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;6&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;7&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;8&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;9&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;10&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;11&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;12&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;13&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;14&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;15&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;16&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;17&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;18&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;class&quot;&gt;&lt;span class=&quot;keyword&quot;&gt;class&lt;/span&gt; &lt;span class=&quot;title&quot;&gt;CustomCrawlCommand&lt;/span&gt;&lt;span class=&quot;params&quot;&gt;(Command)&lt;/span&gt;:&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;function&quot;&gt;&lt;span class=&quot;keyword&quot;&gt;def&lt;/span&gt; &lt;span class=&quot;title&quot;&gt;run&lt;/span&gt;&lt;span class=&quot;params&quot;&gt;(self, args, opts)&lt;/span&gt;:&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &lt;span class=&quot;keyword&quot;&gt;if&lt;/span&gt; len(args) &amp;lt; &lt;span class=&quot;number&quot;&gt;1&lt;/span&gt;:&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            &lt;span class=&quot;keyword&quot;&gt;raise&lt;/span&gt; UsageError()&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &lt;span class=&quot;keyword&quot;&gt;elif&lt;/span&gt; len(args) &amp;gt; &lt;span class=&quot;number&quot;&gt;1&lt;/span&gt;:&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            &lt;span class=&quot;keyword&quot;&gt;raise&lt;/span&gt; UsageError(&lt;span class=&quot;string&quot;&gt;&amp;quot;running &amp;apos;scrapy crawl&amp;apos; with more than one spider is no longer supported&amp;quot;&lt;/span&gt;)&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        spname = args[&lt;span class=&quot;number&quot;&gt;0&lt;/span&gt;]&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &lt;span class=&quot;comment&quot;&gt;# added new code&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        spider_settings_path = self.settings.getdict(&lt;span class=&quot;string&quot;&gt;&amp;apos;SPIDER_SETTINGS&amp;apos;&lt;/span&gt;, {}).get(spname, &lt;span class=&quot;keyword&quot;&gt;None&lt;/span&gt;)&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &lt;span class=&quot;keyword&quot;&gt;if&lt;/span&gt; spider_settings_path &lt;span class=&quot;keyword&quot;&gt;is&lt;/span&gt; &lt;span class=&quot;keyword&quot;&gt;not&lt;/span&gt; &lt;span class=&quot;keyword&quot;&gt;None&lt;/span&gt;:&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            self.settings.setmodule(spider_settings_path, priority=&lt;span class=&quot;string&quot;&gt;&amp;apos;cmdline&amp;apos;&lt;/span&gt;)&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &lt;span class=&quot;comment&quot;&gt;# end&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;                 &lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        crawler = self.crawler_process.create_crawler()&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        spider = crawler.spiders.create(spname, **opts.spargs)&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        crawler.crawl(spider)&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        self.crawler_process.start()&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt;The commented part is new code, others are same as run() function in &lt;em&gt;scrapy.commands.crawl.Command&lt;/em&gt; class. The Scrapy &lt;em&gt;settings&lt;/em&gt; has four priorities: &lt;em&gt;default, command, project, cmdline&lt;/em&gt;, the &lt;em&gt;cmdline&lt;/em&gt; has a top priority, use it to overwrite default setting items which are in &lt;em&gt;settings.py&lt;/em&gt;. &lt;em&gt;&amp;quot;SPIDER_SETTINGS&amp;quot;&lt;/em&gt; is a setting item in settings.py, it is a dictionary, the key is a spider name, the value is the spider&amp;apos;s custom setting file name.&lt;/p&gt;
&lt;h2 id=&quot;create-common-spiders-and-settings&quot;&gt;Create common spiders and settings&lt;/h2&gt;
&lt;p&gt;&lt;em&gt;tutorial.tutorial.common_spider.CommonSpider&lt;/em&gt; is a spider which includes a normal parsing process for a website and some common functions. &lt;em&gt;settings.py&lt;/em&gt; includes common setting items for all spiders, such as &lt;em&gt;LOG_LEVEL&lt;/em&gt;, you can overwrite them in a spider custom setting file, such as &lt;em&gt;spider1.py&lt;/em&gt; and &lt;em&gt;spider2.py&lt;/em&gt; in &lt;em&gt;tutorial.tutorial.spider_settings&lt;/em&gt; directory.&lt;/p&gt;
&lt;p&gt;common_spider.py&lt;/p&gt;
&lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;2&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;3&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;4&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;5&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;6&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;7&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;8&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;9&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;10&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;11&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;12&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;13&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;14&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;15&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;16&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;17&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;18&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;19&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;20&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;21&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;22&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;23&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;24&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;25&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;26&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;27&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;28&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;29&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;30&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;31&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;32&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;33&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;34&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;35&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;36&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;37&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;38&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;class&quot;&gt;&lt;span class=&quot;keyword&quot;&gt;class&lt;/span&gt; &lt;span class=&quot;title&quot;&gt;CommonSpider&lt;/span&gt;&lt;span class=&quot;params&quot;&gt;(Spider)&lt;/span&gt;:&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;string&quot;&gt;&amp;quot;&amp;quot;&amp;quot;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        This is a common spider, including common functions which child spiders can inherit or overwrite&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &amp;quot;&amp;quot;&amp;quot;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    name = &lt;span class=&quot;string&quot;&gt;&amp;apos;&amp;apos;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    allowed_domains = []&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    start_urls = []&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;comment&quot;&gt;# must add &amp;quot;kwargs&amp;quot;, otherwise can&amp;apos;t run in scrapyd&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;function&quot;&gt;&lt;span class=&quot;keyword&quot;&gt;def&lt;/span&gt; &lt;span class=&quot;title&quot;&gt;__init__&lt;/span&gt;&lt;span class=&quot;params&quot;&gt;(self, settings, **kwargs)&lt;/span&gt;:&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        super(CommonSpider, self).__init__(**kwargs)&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        self._start_urls = []&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        self._start_urls.extend(settings.get(&lt;span class=&quot;string&quot;&gt;&amp;apos;START_URLS&amp;apos;&lt;/span&gt;, []))&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &lt;span class=&quot;keyword&quot;&gt;if&lt;/span&gt; &lt;span class=&quot;keyword&quot;&gt;not&lt;/span&gt; self._start_urls:&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            &lt;span class=&quot;keyword&quot;&gt;raise&lt;/span&gt; Exception(&lt;span class=&quot;string&quot;&gt;&amp;apos;no urls to crawl&amp;apos;&lt;/span&gt;)&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;meta&quot;&gt;    @classmethod&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;function&quot;&gt;&lt;span class=&quot;keyword&quot;&gt;def&lt;/span&gt; &lt;span class=&quot;title&quot;&gt;from_settings&lt;/span&gt;&lt;span class=&quot;params&quot;&gt;(cls, settings, **kwargs)&lt;/span&gt;:&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &lt;span class=&quot;keyword&quot;&gt;return&lt;/span&gt; cls(settings, **kwargs)&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;meta&quot;&gt;    @classmethod&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;function&quot;&gt;&lt;span class=&quot;keyword&quot;&gt;def&lt;/span&gt; &lt;span class=&quot;title&quot;&gt;from_crawler&lt;/span&gt;&lt;span class=&quot;params&quot;&gt;(cls, crawler, **kwargs)&lt;/span&gt;:&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &lt;span class=&quot;keyword&quot;&gt;return&lt;/span&gt; cls.from_settings(crawler.settings, **kwargs)&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;function&quot;&gt;&lt;span class=&quot;keyword&quot;&gt;def&lt;/span&gt; &lt;span class=&quot;title&quot;&gt;start_requests&lt;/span&gt;&lt;span class=&quot;params&quot;&gt;(self)&lt;/span&gt;:&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        &lt;span class=&quot;keyword&quot;&gt;for&lt;/span&gt; url &lt;span class=&quot;keyword&quot;&gt;in&lt;/span&gt; self._start_urls:&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            &lt;span class=&quot;comment&quot;&gt;# must append these hosts, otherwise OffsiteMiddleware will filter them&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            parsed_url = urlparse.urlparse(url)&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            parsed_url.hostname &lt;span class=&quot;keyword&quot;&gt;and&lt;/span&gt; self.allowed_domains.append(parsed_url.hostname)&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            &lt;span class=&quot;comment&quot;&gt;# open(&amp;apos;file name&amp;apos;, &amp;apos;a+&amp;apos;) is different between OS X and Linux, &lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            &lt;span class=&quot;comment&quot;&gt;# read an empty filter list from &amp;lt;JOBDIR&amp;gt;/requests.seen when launche the spider on OS X, &lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            &lt;span class=&quot;comment&quot;&gt;# be careful &amp;quot;dont_filter&amp;quot;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            &lt;span class=&quot;keyword&quot;&gt;yield&lt;/span&gt; Request(url, callback=self.parse, method=&lt;span class=&quot;string&quot;&gt;&amp;apos;GET&amp;apos;&lt;/span&gt;, dont_filter=&lt;span class=&quot;keyword&quot;&gt;True&lt;/span&gt;)&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;function&quot;&gt;&lt;span class=&quot;keyword&quot;&gt;def&lt;/span&gt; &lt;span class=&quot;title&quot;&gt;parse&lt;/span&gt;&lt;span class=&quot;params&quot;&gt;(self, response)&lt;/span&gt;:&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        self.log(&lt;span class=&quot;string&quot;&gt;&amp;apos;response url: %s, status: %d&amp;apos;&lt;/span&gt; % (response.url, response.status), INFO)&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt;settings.py&lt;/p&gt;
&lt;figure class=&quot;highlight sml&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;2&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;3&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;4&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;5&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;6&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;7&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;8&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;type&quot;&gt;COMMANDS_MODULE&lt;/span&gt; = &lt;span class=&quot;symbol&quot;&gt;&amp;apos;commands&amp;apos;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;type&quot;&gt;SPIDER_SETTINGS&lt;/span&gt; = {&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;symbol&quot;&gt;&amp;apos;spider1&amp;apos;&lt;/span&gt;: &lt;span class=&quot;symbol&quot;&gt;&amp;apos;tutorial&lt;/span&gt;.spider_settings.spider1&amp;apos;,&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;symbol&quot;&gt;&amp;apos;spider2&amp;apos;&lt;/span&gt;: &lt;span class=&quot;symbol&quot;&gt;&amp;apos;tutorial&lt;/span&gt;.spider_settings.spider2&amp;apos;,&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;}&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;type&quot;&gt;LOG_LEVEL&lt;/span&gt; = &lt;span class=&quot;symbol&quot;&gt;&amp;apos;INFO&amp;apos;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;h2 id=&quot;create-multiple-spiders-in-a-project&quot;&gt;Create multiple spiders in a project&lt;/h2&gt;
&lt;h3 id=&quot;spider-without-custom-parsing-process&quot;&gt;spider without custom parsing process&lt;/h3&gt;
&lt;p&gt;like &lt;em&gt;tutorial.tutorial.spiders.spider1.Spider1&lt;/em&gt;&lt;br&gt;
Spider1&amp;apos;s setting file: spider1.py (in &lt;em&gt;&amp;quot;spider_settings&amp;quot;&lt;/em&gt; directory)&lt;/p&gt;
&lt;figure class=&quot;highlight ini&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;2&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;3&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;4&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;5&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;attr&quot;&gt;LOG_FILE&lt;/span&gt; = &lt;span class=&quot;string&quot;&gt;&amp;apos;spider1.log&amp;apos;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;attr&quot;&gt;JOBDIR&lt;/span&gt;=&lt;span class=&quot;string&quot;&gt;&amp;apos;spider1_job&amp;apos;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;attr&quot;&gt;START_URLS&lt;/span&gt; = [&lt;span class=&quot;string&quot;&gt;&amp;apos;http://www.bing.com/news&amp;apos;&lt;/span&gt;]&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt;Spider1&amp;apos;s source file: Spider1.py (in &lt;em&gt;&amp;quot;spiders&amp;quot;&lt;/em&gt; directory)&lt;/p&gt;
&lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;2&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;3&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;4&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;5&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;keyword&quot;&gt;from&lt;/span&gt; ..common_spider &lt;span class=&quot;keyword&quot;&gt;import&lt;/span&gt; CommonSpider&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;class&quot;&gt;&lt;span class=&quot;keyword&quot;&gt;class&lt;/span&gt; &lt;span class=&quot;title&quot;&gt;Spider1&lt;/span&gt;&lt;span class=&quot;params&quot;&gt;(CommonSpider)&lt;/span&gt;:&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    name = &lt;span class=&quot;string&quot;&gt;&amp;apos;spider1&amp;apos;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;h3 id=&quot;spider-with-custom-parsing-process&quot;&gt;spider with custom parsing process&lt;/h3&gt;
&lt;p&gt;like &lt;em&gt;tutorial.tutorial.spiders.spider2.Spider2&lt;/em&gt;&lt;br&gt;
Spider2&amp;apos;s setting file: spider2.py (in &lt;em&gt;&amp;quot;spider_settings&amp;quot;&lt;/em&gt; directory)&lt;/p&gt;
&lt;figure class=&quot;highlight ini&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;2&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;3&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;4&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;5&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;6&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;7&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;attr&quot;&gt;LOG_FILE&lt;/span&gt; = &lt;span class=&quot;string&quot;&gt;&amp;apos;spider2.log&amp;apos;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;attr&quot;&gt;JOBDIR&lt;/span&gt;=&lt;span class=&quot;string&quot;&gt;&amp;apos;spider2_job&amp;apos;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;attr&quot;&gt;START_URLS&lt;/span&gt; = [&lt;span class=&quot;string&quot;&gt;&amp;apos;http://www.bing.com/knows&amp;apos;&lt;/span&gt;]&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;attr&quot;&gt;TITLE_PATH&lt;/span&gt; = &lt;span class=&quot;string&quot;&gt;&amp;apos;html head title::text&amp;apos;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;p&gt;Spider2&amp;apos;s source file: Spider2.py (in &lt;em&gt;&amp;quot;spiders&amp;quot;&lt;/em&gt; directory)&lt;/p&gt;
&lt;figure class=&quot;highlight python&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;2&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;3&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;4&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;5&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;6&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;7&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;8&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;9&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;10&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;11&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;12&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;13&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;14&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;15&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;16&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;17&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;18&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;19&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;20&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;21&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;keyword&quot;&gt;from&lt;/span&gt; scrapy.log &lt;span class=&quot;keyword&quot;&gt;import&lt;/span&gt; INFO&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;keyword&quot;&gt;from&lt;/span&gt; ..common_spider &lt;span class=&quot;keyword&quot;&gt;import&lt;/span&gt; CommonSpider&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;span class=&quot;class&quot;&gt;&lt;span class=&quot;keyword&quot;&gt;class&lt;/span&gt; &lt;span class=&quot;title&quot;&gt;Spider2&lt;/span&gt;&lt;span class=&quot;params&quot;&gt;(CommonSpider)&lt;/span&gt;:&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    name = &lt;span class=&quot;string&quot;&gt;&amp;apos;spider2&amp;apos;&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;comment&quot;&gt;# must add &amp;quot;kwargs&amp;quot;, otherwise can&amp;apos;t run in scrapyd&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;function&quot;&gt;&lt;span class=&quot;keyword&quot;&gt;def&lt;/span&gt; &lt;span class=&quot;title&quot;&gt;__init__&lt;/span&gt;&lt;span class=&quot;params&quot;&gt;(self, settings, **kwargs)&lt;/span&gt;:&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        super(Spider2, self).__init__(settings, **kwargs)&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        self._title_path = settings.get(&lt;span class=&quot;string&quot;&gt;&amp;apos;TITLE_PATH&amp;apos;&lt;/span&gt;, &lt;span class=&quot;string&quot;&gt;&amp;apos;&amp;apos;&lt;/span&gt;)&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;function&quot;&gt;&lt;span class=&quot;keyword&quot;&gt;def&lt;/span&gt; &lt;span class=&quot;title&quot;&gt;parse_other_info&lt;/span&gt;&lt;span class=&quot;params&quot;&gt;(self, response)&lt;/span&gt;:&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        title = response.css(self._title_path).extract()[&lt;span class=&quot;number&quot;&gt;0&lt;/span&gt;]&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        self.log(&lt;span class=&quot;string&quot;&gt;&amp;apos;title: %s&amp;apos;&lt;/span&gt; % title, INFO)&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    &lt;span class=&quot;function&quot;&gt;&lt;span class=&quot;keyword&quot;&gt;def&lt;/span&gt; &lt;span class=&quot;title&quot;&gt;parse&lt;/span&gt;&lt;span class=&quot;params&quot;&gt;(self, response)&lt;/span&gt;:&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        self.parse_other_info(response)&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        super(Spider2, self).parse(response)&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
&lt;h2 id=&quot;run-spiders&quot;&gt;Run spiders&lt;/h2&gt;
&lt;ol&gt;
&lt;li&gt;set &lt;em&gt;PYTHONPATH&lt;/em&gt; to &lt;em&gt;&amp;quot;/&amp;lt;path&amp;gt;/scrapy_multiple_spiders&amp;quot;&lt;/em&gt;&lt;/li&gt;
&lt;li&gt;in &lt;em&gt;&amp;quot;/&amp;lt;path&amp;gt;/scrapy_multiple_spiders/tutorial&amp;quot;&lt;/em&gt;, call &lt;em&gt;scrapy crawl spider1&lt;/em&gt; or &lt;em&gt;scrapy crawl spider2&lt;/em&gt;, check log file &lt;em&gt;spider1.log&lt;/em&gt; or &lt;em&gt;spider2.log&lt;/em&gt;&lt;/li&gt;
&lt;/ol&gt;
</content>
    
    <summary type="html">
    
      &lt;h2&gt;Overview&lt;/h2&gt;
&lt;p&gt;Different channel&#39;s structure in a websit are similar, sometimes we want to reuse source code and don&#39;t create a &lt;a href=&quot;http://scrapy.org/&quot;&gt;Scrap&lt;/a&gt; project per channel. This is a tutorial how to use multiple spiders in a Scrapy project.&lt;/p&gt;
&lt;h2&gt;ENV&lt;/h2&gt;
&lt;p&gt;Python: 2.7.5&lt;br&gt;
Scrapy: 0.24.2&lt;/p&gt;
&lt;h2&gt;Tree-like directories of this tutorial project&lt;/h2&gt;
&lt;p&gt;Source code in GitHub: &lt;a href=&quot;https://github.com/lnxpgn/scrapy_multiple_spiders&quot;&gt;scrapy_multiple_spiders&lt;/a&gt;&lt;/p&gt;
&lt;figure class=&quot;highlight stylus&quot;&gt;&lt;table&gt;&lt;tr&gt;&lt;td class=&quot;gutter&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;1&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;2&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;3&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;4&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;5&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;6&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;7&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;8&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;9&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;10&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;11&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;12&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;13&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;14&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;15&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;16&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;17&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;18&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;19&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;20&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;td class=&quot;code&quot;&gt;&lt;pre&gt;&lt;span class=&quot;line&quot;&gt;scrapy_multiple_spiders&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;├── commands&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;│   ├── __init__&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;│   └── crawl&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;└── tutorial&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    ├── scrapy&lt;span class=&quot;selector-class&quot;&gt;.cfg&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;    └── tutorial&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        ├── __init__&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        ├── common_spider&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        ├── items&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        ├── pipelines&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        ├── settings&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        ├── spider_settings&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        │   ├── __init__&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        │   ├── spider1&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        │   └── spider2&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;        └── spiders&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            ├── __init__&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            ├── spider1&lt;span class=&quot;selector-class&quot;&gt;.py&lt;/span&gt;&lt;/span&gt;&lt;br&gt;&lt;span class=&quot;line&quot;&gt;            └── spider2.py&lt;/span&gt;&lt;br&gt;&lt;/pre&gt;&lt;/td&gt;&lt;/tr&gt;&lt;/table&gt;&lt;/figure&gt;
    
    </summary>
    
    
      <category term="Scrapy" scheme="http://lnxpgn.github.io/tags/Scrapy/"/>
    
      <category term="Python" scheme="http://lnxpgn.github.io/tags/Python/"/>
    
      <category term="Crawler" scheme="http://lnxpgn.github.io/tags/Crawler/"/>
    
      <category term="爬虫" scheme="http://lnxpgn.github.io/tags/%E7%88%AC%E8%99%AB/"/>
    
  </entry>
  
</feed>
